[

    {
        "id": "1",
        "icon": "./img/chipadvisor/1-nico.jpg",
        "title": " Chip Review #1 - Taberna Nico, Granada ",
        "content": " They say that man must suffer for his art. Be it through performance or otherwise. So on my quest to locate the perfect chip I am prepared to suffer through the mountains of soggy shit, the piles of unsatisfactory treats or overly salty 'tables. So, our story begins on a sunny day in Granada. Myself and 3 workmates had just finished a riveting training session on how to text English and we were famished. I had heard of a bar (actually I had been there multiple times before, but I didn't say that) that serves banging chicken wings. The bar in question: Taberna Nico, situated on a street just off of Pedro Antonio. It's a nice place. Well... Dirty but also dirty cheap - €1 for half a litre of beer - and we sat down, ordered beer and wings, and waited. This is not about beer, nor is it about wings. It's about chips. And here they are. <img class=\" wp-image-16 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/02/20180223_1402471.jpg\" > Not bad, eh? So, on to the criteria... All rated out of 5 <br> Crispyness - 2 Kind of disappointing, but I assume that the cook was rushed for time and so had to adjust accordingly. Flavour - 4 Strong showing in this department, I thoroughly enjoyed the taste of these potatoey treats, no idea why, maybe the oil? Texture - 3 Kind of soggy in places, neither hard nor soft or fluffy. Smell - 3 Smells like chips Condiments - 4 Two decadent sauces were available, bbq and alioli. Very nice. Seasoning - 2 Did have some salt. Would like to have seen some pepper or perhaps Cajun seasoning. Temperature - 4 Were very recently cooked and was pleasantly warning to the stomach. Overall, I would rate these chips 3/5 as, whilst they have a very pleasant flavour, I feel that it was somewhat lacking in the looks and texture department. Thank you ",
        "rating": "3.0",
        "location": [
            {
                "name": "Taberna Nico",
                "address": "Calle Martinez de La Rosa 23, Granada",
                "lat": 37.177560,
                "long": -3.608671
            }
        ]
    },
    {
        "id": "2",
        "icon": "./img/chipadvisor/2-gramola.jpg",
        "title": " Chip Review #2 - La Gramola/La Locura Del Rey, Granada ",
        "content": " <i>I'm a sucker for French fries, I love that they're salty! - Megan Hilty</i> Our next chapter takes us to the sleepy (stabby) neighborhood of Chana. Trying out some new tapas bars is also a risky business and this bar in particular seemed to want to kill me with raw fish. The bar I visited is called La Gramola, and at first glimpse it was everything I expected from a bar; busy and warm. A busy bar is never bad (normally), it signals that the locals trust the service. Anyway, we ordered coke zero, cazón (dogfish) and a chicken burger. After my review of yesterday I have decided that an overhaul of the ratings system was desperately needed. I have condensed the criteria into five easy to understand factors - appearance, taste, texture, condiments and freshness. And here they are: <img src=\"https://chipsreviewforu.files.wordpress.com/2018/02/20180224_210835.jpg\" class=\"failed  chipimg wp-image-18\" > Appearance - 2 From afar I had hopes for these chips, but alas, when they were slammed down on the table in front of my wistful gaze, I was already disappointed. Taste 1 - My first taste was bland nothing. My second attempt was somehow even worse. Not even salt. Texture 1 - I can't really describe the texture of these chips. The outside wasn't crispy, the inside wasn't fluffy. It was akin to eating a paper towel. Condiments 2 - Cheap tomato sauce and cheap mayo. But better than nothing I guess. Freshness 3 - These chips had been cooked somewhat recently, maybe in the 10 minutes before they came to me. Overall 1.5 - In all, I think that I would be very unlucky to have worse chips on my journey, yet, somehow I think I will.... Thankyou ",
        "rating": "1.5",
        "location": [
            {
                "name": "La Gramola",
                "address": "C. Dorada, 1, Granada",
                "lat": "37.187385",
                "long": "-3.619089"
            }
        ]
    },
    {
        "id": "3",
        "icon": "./img/chipadvisor/3-los-hermanos.jpg",
        "title": " Chip Review #3 - Asadero Los Hermanos, Granada ",
        "content": " On my quest, I have already discovered a few things... The first being that I eat way too many chips, and the second, that when chips are bad they are the worst thing on earth but when they are great, they can make your life worth living. Today's assignment brings us to Asadero Los Hermanos, about 3 minutes away from my home. A place of consistently high quality, I have enjoyed food rich with flavor and succulent meats. However, as normal, we only care about the chips. Here they are! <img class=\" wp-image-20 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/02/20180225_143733.jpg\" > Appearance 4 - Golden. Beautiful. Taste 4 - A truly good chip, one that any self rating food establishment should strive to achieve. Texture 4 - Again, almost perfect. Crispy on the outside and fluffy in the middle. Only criticism I have is that the chips could be slightly thicker, allowing moor fluffy center. Condiments 4 - A side of store-made alioli gave these bad boys a whole other dimension of flavour. Freshness 5 - I watched them being made in front of my very eyes. A wonderful thing to see. Overall 4 - I think it will be hard to find better in this city. Yet I will continue to search and let you know. Would definitely recommend these chips to anyone. Thankyou ",
        "rating": "4",
        "location": [
            {
                "name": "Asadero Los Hermanos",
                "address": "Ctra. de Málaga, Granada",
                "lat": "37.189130",
                "long": "-3.622026"
            }
        ]
    },
    {
        "id": "4",
        "icon": "./img/chipadvisor/4-la-casilla.jpg",
        "title": " Chip Review #4 - La Casilla, Cabra",
        "content": " Some time in the past there was a potato famine in Ireland. Tragically, many people lost their lives in the resulting starvation. Even more tragically, those people never got to experience what it's like to eat a truly great chip. This evening I am in the lovely town of Cabra, population 20,000. Events-wise there isn't a whole deal going on. However, what they lack in action they more than make up for with the quality of their food. Location of today: La Casilla. Built some time in the last 800+ years it's a homely place which the locals frequent with gusto. Food made fresh and tasty, I ordered some breaded chicken breast, it was very nice. Naturally it came with chips. <img class=\" chipimg wp-image-25\" src=\"https://chipsreviewforu.files.wordpress.com/2018/03/20180303_225339.jpg\" > When I saw these I wasn't overly impressed. Sure, they look rustic but I've been fooled before. The first chip that entered my mouth filled me with such joy I almost cried. Texture 5 - Absolutely perfect! What the chips of my previous review lacked was density. These chips were crispy and also had a substantial center. I could not hope for more. Taste 4 - They were good. A very strong showing in this department however maybe they could be improved further with some better seasoning. Appearance 3 - As stated earlier, they didn't give a good first impression. Freshness 5 - Piping hot and straight from the fryer. Almost burnt my tongue on some of the larger ones. Awesome. Condiments 3 - Came with bog standard mayonnaise and tomato sauce. Not bad, not great. If you are ever in Cabra, this place is a must go. These chips fill me with happiness. And starch. Thankyou ",
        "rating": "4",
        "location": [
            {
                "name": "La Casilla",
                "address": "C. Martín Belda, 14, Cabra",
                "lat": "37.47179297576616",
                "long": "-4.443418457999062"
            }
        ]
    },
    {
        "id": "5",
        "icon": "./img/chipadvisor/5-asador-manolo.jpg",
        "title": "Chip Review #5 - Asador Manolo, Lucena",
        "content": " Asador Manolo. The location of our most recent excursion. We traveled to this restaurant in Lucena to celebrate the birthday of my suegra (technically mother in law but I'm using it). It was a very busy place, so busy that they actually forgot we booked the table. As an asador, they fulfilled my meaty expectations with flying colors but as always, the only important thing is the chips. Have a look. <img class=\" wp-image-28 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/03/20180304_154931.jpg\"  /> Appearance 3 - They don't really look like chips to be honest. More like randomly shaped potato cubes. Taste 4 - Thankfully they had a pleasant taste but the texture... Texture 2 - Most weren't crispy and a large number of them were not soft in the middle. Undercooked. Condiments 4 - A side of alioli was very pleasing, but you can't polish a texture turd. Freshness 3 - I'm not sure how long they were sitting before they came to me. But my hopes in general were dashed on this occasion. Overall 3.5 - I won't say that I disliked them, but there were many things to be desired. However, if you are a fan of big meat, I wholly recommend you visit. Thankyou ",
        "rating": "3.5",
        "location": [
            {
                "name": "Asador Manolo",
                "address": "Rda. Llano de las Tinajerías, Lucena",
                "lat": "37.41215293220452",
                "long": "-4.47891729610861"
            }
        ]
    },
    {
        "id": "6",
        "icon": "./img/chipadvisor/6-brasilia.jpg",
        "title": " Chip Review #6 - Brasilia, Granada",
        "content": " This actually happened a few days ago. I just haven't had the time to publish my findings. Anyway, it was a warm but windy Tuesday lunchtime and I was peckish for potatoes. I went to Brasilia in plaza San Lázaro. It's never been an establishment of particularly high standards, its main appeal has been that it's cheap and quick. And the chips came veeeery quick. <img class=\" wp-image-33 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/03/20180313_143601.jpg\" > Looks 3 - As you can see, they don't look bad at all. A little basic maybe, but definitely a standard chip. Flavour 3 - They tasted ok. But just ok. Texture 2 - Probably the worst texture I've experienced so far, they were like chewing on dirt. Condiments 0 - These didn't even come with salt. Not good. Terrible, in fact. Freshness 2 - They were not cold, but most definitely on the wrong side of warm. Some actually were cold. Overall 1.5 - After eating them this once, I wouldn't recommend them to anyone, unless of course you're homeless or starving. I only ate the thin chips that went a little bit crispy. ",
        "rating": "1.5",
        "location": [
            {
                "name": "Brasilia",
                "address": "Pl. de San Lázaro, 9, Granada",
                "lat": "37.186738330052194",
                "long": "-3.6065583904475766"
            }
        ]
    },
    {
        "id": "7",
        "icon": "./img/chipadvisor/7-ugarit.jpg",
        "title": " Chip Review #7 - Ugarit, Granada ",
        "content": " <blockquote>What makes a chip? In man's constant pursuit of greatness we have achieved much; walking on the moon, medicine and more. But we are yet to create the perfect chip. Me - 2018</blockquote> Yesterday was the final day of term. We had worked long and hard this week and were finally ready to let loose and have fun for a whole week. So we came to Ugarit. A nice place, even if our waiter looked like Count Dracula. Here are los chipos. <img class=\" wp-image-35 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/03/20180322_220946.jpg\"> Looks 3 - They look alright, can't complain really. Flavour 3 - Again, a bog standard chip. Texture 3 - The chips hinted at a crispy outside yet fell short at the final hurdle. Condiments 0 - None at all! Not even salt. This is outrageous!! Freshness 5 - Straight from the fryer and provided a warming sensation to my belly. Overall 3 - Could have been so much better and I'm sure if they pulled their thumbs out I'd be a happy man. Thankyou ",
        "rating": "3",
        "location": [
            {
                "name": "Ugarit",
                "address": "C. Natalio Rivas, Granada",
                "lat": "37.18211088262166",
                "long": "-3.6012572880830787"
            }
        ]
    },
    {
        "id": "8",
        "icon": "./img/chipadvisor/8-malaguena.jpg",
        "title": " Chip Review #8 - La Malagueña, Cabra",
        "content": " <b><i>There are many things</i></b> on this strange and incredible planet that we can explain, others we can not. One thing that I struggle to understand is how a restaurant, one famous for its food, can be able to produce incredible fried foods, yet, fail at the most basic and traditional foods of all time. The chip. Last night I ate at this restaurant in Cabra. I won't lie, I love this place, the food is so crazily cheap and bountiful, especially the gambas or calamares. Unfortunately this isn't a food review blog, it's a platform in which I trial the most basic food. Here they come.. <img class=\" chipimg wp-image-39\" src=\"https://chipsreviewforu.files.wordpress.com/2018/03/20180324_230858.jpg\"> To reiterate, I love the food, the flamenquin for example was juicy and meaty. But alas I must talk about the thing you're here for. <ul> <li>Looks 3 - They look pretty good, hand cut possibly and the colour is good.</li> </ul> <ul> <li>Flavour 2 - Unfortunately, they didn't have much flavour at all. They had a faint starchy taste and that was about it...</li> </ul> <ul> <li>Texture 2 - Like many disappointments before the chips had very little texture. They have the consistency of old pancakes .</li> </ul> <ul> <li>Condiments 3 - On the condiment side of things provide us with some mayonnaise. Homemade and very flavorful .</li> </ul> <ul> <li>Freshness 4 - The chips came out of the kitchen in a timely manner. While they weren't blisteringly hot they were very pleasant.</li> </ul> Overall 3 - Again I want to say the food normally in Malageña is perfect. Yet the chips I must say... the chips were very disappointing last night. Thankyou ",
        "rating": "3",
        "location": [
            {
                "name": "La Malagueña",
                "address": "Av. Jose Solis Ruiz, 71, Cabra",
                "lat": "37.47376975731638",
                "long": "-4.442715592373611"
            }
        ]
    },
    {
        "id": "9",
        "icon": "./img/chipadvisor/9-los-pelaos.jpg",
        "title": "Chip Review #9 - Los Pelaos, Cabra",
        "content": " It's a lovely Wednesday, possibly the best date of the year so far. We went to a lovely place today, Me, my lover and black Jesus went to Los Pelaos today. It is a beautiful location... three restaurants along the main part of the busy road and it serves some delicious food. On to the chips... <img class=\"wp-image-41  chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/03/img-20180328-wa0001.jpg\" > Now don't they look good!! <ul> <li>Looks 4 - I'm not sure if the photo does it justice but the chips looked amazing, they had a lovely golden appearance on the outside and they just looked to die for.</li> </ul> <ul> <li>Flavour 4 - I thoroughly enjoyed the taste of these chips. The only reason I didn't give it five is because I feel that there was something missing something... I'm not sure what but it was something.</li> </ul> <ul> <li>Texture 5 - upon biting into these lovely chips the outside was crunchy and firm. The inside was soft like mashed potato.</li> </ul> <ul> <li>Condiments 2 - I regret to say that I have to give a low score on this as they didn't actually have any homemade mayonnaise. All they gave us was a bottle of mayonnaise which really didn't do the job .</li> </ul> <ul> <li>Freshness 4 - the chips came out in a fairly punctual manner they could be faster but all in all pretty good.</li> </ul> Overall 4 - These chips would be a fine addition to your chip experience collection. I wholly recommend that you come to this place and try them. Thankyou ",
        "rating": "4",
        "location": [
            {
                "name": "Los Pelaos",
                "address": "A-339, Km.5, 14940 Cabraa",
                "lat": "37.46258537697161",
                "long": "-4.381192873203425"
            }
        ]
    },
    {
        "id": "10",
        "icon": "./img/chipadvisor/10-la-betrana.jpg",
        "title": "Chip Review #10 - La Betrana, Cabra",
        "content": " <blockquote>I love the way the chips feel all over my body especially the way the potato mashes out in a sitlky smooth paste.<br><br>Me - 2018</blockquote><br>Wednesday was a very long day, eating two full meals including chips. We went to a place called La Betrana, a fancy restaurant in Cabra. It's posh, but not posh enough to serve adecups chips as we will see....<br><br>Here they come...<br><br><img class=\"chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/03/20180328_232433.jpg\" /><br><ul><li>Looks 3 - On first glance, yes, they look alright, kind of like oven chips.</li></ul><ul><li>Flavour 1 - The flavour was... Well there was no flavour. Disappointing blandness.</li></ul><ul><li>Texture 2 - They really did have the consistency of oven chips. Terrible boring oven chips.</li></ul><ul><li>Condiments 2 - They had salt.</li></ul><ul><li>Freshness 4 - Estimated time from kitchen to table: 2 minutes.</li></ul>Overall 2.5 - Painfully average really, but I hate oven chips and I don't want to eat them again.<br><br>Thankyou. ",
        "rating": "2.5",
        "location": [
            {
                "name": "La Betrana",
                "address": "Av. Federico García Lorca, 20, Cabra",
                "lat": "37.470381304775906",
                "long": "-4.439694903889057"
            }
        ]
    },
    {
        "id": "11",
        "icon": "./img/chipadvisor/11-centro-filarmonico.jpg",
        "title": "Chip Review #11 - Centro Filarmónico, Cabra",
        "content": " The fourth chip review from Semana Santa, yet not the last. Friday lunchtime... everyone's tired, everyone's hungry. Once again to a place I have never been before, so I didn't know what to expect. There are a large number of us sitting down to eat , the food took a very long time to come out. In fact, a lot of the food is very nice . I particularly enjoyed the flamenquin. But alas, it's not about the quality of those foods, it's about the quality of chips. And here they come. <img class=\" wp-image-45 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/04/20180330_151326.jpg\"> <ul> <li>Looks 2 - They don't look particularly cooked... Do they? I had the same feeling on that day.</li> </ul> <ul> <li>Flavour 3 - Whilst the flavor of these chips was not disappointing, I was disappointed by its lack.</li> </ul> <ul> <li>Texture 3 - These chips were not crispy , but they were not soggy. They were unevenly cooked.</li> </ul> <ul> <li>Condiments 3 - mayonnaise provided didn't taste particularly homemade but it was pleasant. The salt on the chips was also welcome.</li> </ul> <ul> <li>Freshness 3 - Hot, time between kitchen and table - three minutes.</li> </ul> Overall 2.5 - I removed an extra .5 points because of the unevenness of the chips . I am disappointed because the rest of the food was very good. Thankyou ",
        "rating": "2.5",
        "location": [
            {
                "name": "Centro Filarmónico",
                "address": "C. Priego, 34, Cabra",
                "lat": "37.47013094566113",
                "long": "-4.442031875019123"
            }
        ]
    },
    {
        "id": "12",
        "icon": "./img/chipadvisor/12-san-martin.jpg",
        "title": "Chip Review #12 - San Martín, Cabra",
        "content": " Saturday. You need to understand how many chips I've eaten in the last week, it's a lot. I ate chips on average twice a day from Monday to Saturday, and for the last few days I have felt disgusting, like a deep fat fryer that the chips are made in. So here we are, the final chips of Easter. At this point obviously I'm sick of eating chips, but I have to give a good go one last time. The restaurant, another place in Cabra. The place is very good... it actually has one Michelin star, so naturally I had to try the chips. <img class=\" wp-image-49 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/04/20180331_215536.jpg\"> I know that they don't actually look like chips, more like potato wedges. Yet I felt was needed to give a fair and just review as I believe I am a fair and just person . All potatoes deserve love. <ul> <li>Looks 4 - I enjoy things that are presented differently. so these chips really tickled my fancy when I saw them.</li> </ul> <ul> <li>Flavour 3 - Unfortunately, the taste did not match with the looks. Oh what could have been.</li> </ul> <ul> <li>Texture 3 - The chips were ununiformly fried that was some inconsistency of the texture, somewhat crispy, somewhat not.</li> </ul> <ul> <li>Condiments 3 - As common in Spanish culinary culture, mayonnaise was provided. Was nice.</li> </ul> <ul> <li>Freshness 4 - I think they were very nice to be honest. Estimated time from kitchen to table: 2 minutes.</li> </ul> Overall 3.5 - A pleasant experience. Short of texture I had nothing to complain about. Thankyou ",
        "rating": "3.5",
        "location": [
            {
                "name": "San Martín",
                "address": "Pl. España, 6, 14940 Cabra",
                "lat": "37.4734272017967",
                "long": "-4.443021298591907"
            }
        ]
    },
    {
        "id": "13",
        "icon": "./img/chipadvisor/13-hannigans.jpg",
        "title": "Chip Review #13 - Hannigan and Sons, Granada",
        "content": " It was a lovely Friday night with my friends. We had decided to spend the night drinking in a lovely Irish pub \"Hannigan and sons\". So I naturally wasn't planning to eat anything but after the fourth or fifth (hard to recall) we decided that we needed something to line our stomachs. Which brings us to these. <img class=\" wp-image-54 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/05/20180504_221003.jpg\"> Cheesy chips with bacon. The deluxe pub snack. Whilst I do prefer the plain chip, I feel there is nothing wrong with indulging every once in a while. On to the ratings... <ul> <li>Look 3 - They certainly look more impressive than a plain bowl of chips, but I knew just from seeing them there would be problems with texture...</li> </ul> <ul> <li>Flavour 4 - Cheese with bacon is bloody lovely it is. The chips themselves added nothing.</li> </ul> <ul> <li>Texture 1 - Oh dear. Oh dear oh dear. It was just a lump of wet greasyness.</li> </ul> <ul> <li>Condiments 5 - There was HP sauce, Heinz and mayonnaise. Three of a perfect pair.</li> </ul> <ul> <li>Freshness 4 - They did come out quick. Approx time from kitchen to table: 2 minutes.</li> </ul> <ul> <li>Overall 3.5 - I guess they were enjoyable. It's a shame that most of the pleasure did not come from the potato.</li> </ul> Thankyou ",
        "rating": "3.5",
        "location": [
            {
                "name": "Hannigan and Sons",
                "address": "C. Cetti Meriem, 1,Granada",
                "lat": "37.177298456272304",
                "long": "-3.5977834037667704"
            }
        ]
    },
    {
        "id": "14",
        "icon": "./img/chipadvisor/14-mariano-pescador.jpg",
        "title": "Chip Review #14 - Mariano Pescadores, Granada",
        "content": " Disclaimer; this actually happened over a week ago. I have been busy, too busy to make this review until now. Actually, no. But whatever. I had been in Madrid the night before so I was very tired and hungry. I was also meeting a friend for lunch, which brings us to the bar of this review. Situated in plaza de toros, it is very popular with its wide variety of tapas. But the chips... <img class=\" wp-image-57 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/06/img_20180526_151412.jpg\"> <ul> <li>Looks 3 - They look alright, but nothing special. A sign of what was to come.</li> </ul> <ul> <li>Flavour 1 - Oh dear. They tasted like wallpaper paste.</li> </ul> <ul> <li>Texture 0 - Had the consistency of paste, too.</li> </ul> <ul> <li>Condiments 3 - Fortunately, the alioli they serve here is pretty good, so slightly redeeming.</li> </ul> <ul> <li>Freshness 4 - At least they were hot. Time from kitchen to table: 1 minute.</li> </ul> Overall - 1.5 - I was upset by these chips and I do not recommend anyone to try them. Another day they were 2.5 so it's never amazing. Thankyou ",
        "rating": "2.5",
        "location": [
            {
                "name": "Mariano Pescadores",
                "address": "Calle Dr. Fleming, 10, 18012 Granada",
                "lat": "37.190386885112396",
                "long": "-3.608632829810978"
            }
        ]
    },
    {
        "id": "15",
        "icon": "./img/chipadvisor/15-hong-fa.jpg",
        "title": " Chips Review #15 - Chino Hong Fa, Granada ",
        "content": " In the past few months it has been clear that I'm searching for the potatoey grail of chips. It's been an up and down affair with some very high scorers. And some low. Very low. I may not have found the best, but I may have found the worst. And if these aren't the worst... Well, I'd rather not think about that... Yesterday I ordered a Chinese takeaway from my local restaurant in La Chana. Rice with spicy beef which was rather tasty. I also ordered (for some reason) some grilled chicken, which came with a free bag of these bad boys. <img class=\" wp-image-62 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/06/20180606_2105071.jpg\" > <ul> <li>Looks 3 – They do look like chips, but this is where the similarities end.</li> <li>Flavour 1 – They tasted like cardboard and were an insult to my tastebuds.</li> <li>Texture 1 – Had the texture of biting into a polystyrene cup. Upsetting really.</li> <li>Condiments 0 – There were no condiments. Nothing. No salt. No pepper. No residue oil. Nothing.</li> <li>Freshness 1 – Was only lukewarm. Estimated time from kitchen to table: 10 minutes.</li> </ul> Overall 1 – So far the worst chips I have eaten on this quest and I would not recommend them to anyone unless you enjoy suffering ",
        "rating": "1",
        "location": [
            {
                "name": "Chino Hong Fa",
                "address": "Ctra. de Málaga, 47, Granada",
                "lat": "37.18875101524623",
                "long": "-3.620011223158"
            }
        ]
    },
    {
        "id": "16",
        "icon": "./img/chipadvisor/16-los-carmenes.jpg",
        "title": " Chip Review #16 - Los Cármenes, Granada ",
        "content": " It seems that chips are like buses. You spend weeks without eating any, and after the first fluffy treat enters your mouth you spiral into a deep whole of deep fried starchiness. Story time. This actually happened on Friday. I met up with some students and workmates to have a friendly get together, and maybe to drink a shed-load of booze. So after a few bars and jokes we went to Los Carmenes, friendly and warm. As always, none of that is important and all you want to know is one thing... <img class=\" chipimg wp-image-66\" src=\"https://chipsreviewforu.files.wordpress.com/2018/06/20180608_220705.jpg\" > <ul> <li>Looks 2 - Maybe I'm being generous here, as it's hard to make a bad looking chip.</li> </ul> <ul> <li>Flavour 1 - There was a faint taste of potato in there somewhere, hence the '1'</li> </ul> <ul> <li>Texture 2 - Some of the chips were crispy but the vast majority of them were not. A classic case of underfrying.</li> </ul> <ul> <li>Condiments 0 - Again, no condiments at all so it's a big fat zero.</li> </ul> <ul> <li>Freshness 4 - Even if a chip is terrible, if it's hot it can warm your body and make you feel better.</li> </ul> Overall 2 - I'm beginning to lose hope that I'll ever find a decent chip again. Thankyou ",
        "rating": "2",
        "location": [
            {
                "name": "Los Cármenes",
                "address": "Calle Dr. Sánchez Mariscal, 1, Granada",
                "lat": "37.19100448678273",
                "long": "-3.60822084206661"
            }
        ]
    },
    {
        "id": "17",
        "icon": "./img/chipadvisor/17-la-andaluza.jpg",
        "title": " Chip Review #17 - La Andaluza, Granada ",
        "content": " A continuation of yesterday's tale. It is now Saturday lunchtime and I have a raging hangover. My suegra came to visit and take me out to lunch. Maybe I could recover with the help of some yummy chips? So we went to Nevada Shopping, the biggest shopping centre in that place in the hope of finding something good, and this place seemed like it with its slogan; <i>the authentic taste of Andalucía.</i> Yeah... If the authentic taste was shit. Here are the chips. <img class=\" wp-image-68 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/06/20180609_154136.jpg\" > <ul> <li>Looks 1 - The chips themselves looked ok but what was that on top of them? Looked like dog food (tasted like it, too).</li> </ul> <ul> <li>Flavour 1 - As a result, the chips shared the same flavour as the \"meat\" and were not good.</li> </ul> <ul> <li>Texture 0 - Wet and horrible.</li> </ul> <ul> <li>Condiments 1 - I actually put a 2 here before but the place put me in a bad mood so I give it less.</li> </ul> <ul> <li>Freshness 2 - They weren't that cold. I think the lukewarm meat gave the chips their temperature.</li> </ul> Overall 1 - I will never eat at this place as long as I shall live, and I recommend you do the same. Thankyou. ",
        "rating": "1",
        "location": [
            {
                "name": "La Andaluza",
                "address": "Av. de las Palmeras, 75,  Granada",
                "lat": "37.147411944837884",
                "long": "-3.61172928900554"
            }
        ]
    },
    {
        "id": "18",
        "icon": "./img/chipadvisor/18-bar-fernandez.jpg",
        "title": " Chip Review #18 - Bar Fernandez, Granada ",
        "content": " I'm afraid to say, sometimes I get distracted by other things. This happened nearly two weeks ago now. I wholehearted apologise and promise that I'll endeavour to bring you immediate updates in the future. Spain played against Iran and it was actually a pretty dogshit match. Oh well, we went to this fairly nice bar in Ancha de capuchinos. Nice meat sandwich, not for a sandwich, we are here for chips. <img src=\"https://chipsreviewforu.files.wordpress.com/2018/06/20180620_2020172.jpg\" class=\" wp-image-73 chipimg\" > Looks 3 - They do look nice, but a bit too non-uniform for me. Flavour 3 - They did taste of potato yet there wasn't really that much going for them. Texture 2 - Big Letdown, for something that looked so crispy, it was very soggy. Condiments 2 - A little bit of salt thrown on but not on all chips. Freshness 4 - Straight from the fryer and then left on the side for a minute or so. Overall 2.5 - Average chips, if you are in the area I suppose you can try them out but there are much better options around. Thankyou ",
        "rating": "2.5",
        "location": [
            {
                "name": "Bar Fernandez",
                "address": "C. Ancha de Capuchinos, 13, 18012 Granada",
                "lat": "37.18604504637173",
                "long": "-3.6030196614381125"
            }
        ]
    },
    {
        "id": "19",
        "icon":"./img/chipadvisor/19-juanito.jpg",
        "title": " Chip Review #19 - Bar Juanito, Cabra",
        "content": " I'm in Cordoba now. When I'm in Cordoba I like to eat flamenquines. So we came to this place in cabra. I've been there before and it was rather nice. On the menu was 'flamenquin XXL'. So, naturally, i had to try this bad boy out. <img class=\"failed  wp-image-76 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/07/img-20180707-wa0002.jpg\" > It's quite large as you can see... Nevertheless I consumed the entire meaty package and also some calamares, which featured the chips of this review. <img class=\"failed  wp-image-77 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/07/img-20180707-wa00011.jpg\" > <ul> <li>Looks 2 - Maybe I'm becoming more critical with time, but they look fake and horrible.</li> </ul> <ul> <li>Flavour 2 - They were bland and horrible.</li> </ul> <ul> <li>Texture 2 - Boring and horrible.</li> </ul> <ul> <li>Condiments 1 -They had some salt and shitty mayonnaise, but horrible.</li> </ul> <ul> <li>Freshness 3 - They were not cold, not by much though. KTT: 4 minutes.</li> </ul> Overall 2.5 - Probably better than others I gave the same score to, but I'm sick of boring and horrible chips. Thankyou. ",
        "rating": "2.5",
        "location": [
            {
                "name": "Bar Juanito",
                "address": "C. San Fernando, 6, Cabra",
                "lat": "37.476859488094924",
                "long": "-4.429634232587814"
            }
        ]
    },
    {
        "id": "20",
        "icon":"./img/chipadvisor/20-vaquena.jpg",
        "title": "Chip Review #20 - Vaquena, Cabra",
        "content": " This is the first of a number of reviews for this week; so far, three and counting. So you all have a lot to look forward to. So, being in Cordoba now I had to go to yet another restaurant, very popular for its fresh locally sourced beef. I ordered a burger and a cachopo (cheese wrapped in beef and bacon, fried) Here it comes now... <img class=\" wp-image-79 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/07/20180708_221212.jpg\"> Hand cut chips? That's a novelty! <ul> <li>Looks 4 - Like I said, they look different and sometimes different is good when you eat a <strong>lot</strong> of chips.</li> </ul> <ul> <li>Flavour 3 - Unfortunately, they were a bit bland... Not getting much of the flavor of the potato coming through.</li> </ul> <ul> <li>Texture 3 - They weren't crispy, but they were at least soft.</li> </ul> <ul> <li>Condiments 4 - The condiments were pleasant; BBQ sauce and some sort of spicy mayo. Very nice.</li> </ul> <ul> <li>Freshness 2 - Another disappointment. The chips had clearly been sitting waiting for a long time which reduced the freshness and most likely the crispness too.</li> </ul> Overall 3.5 - I recommend this place, if only for the meat. There are better places for chips in Cabra. Thankyou. ",
        "rating": "3.5",
        "location": [
            {
                "name": "Vaquena",
                "address": "CO-6212, Km. 5, 5, Cabra",
                "lat": "37.483926944789836",
                "long": "-4.383735396357552"
            }
        ]
    },
    {
        "id": "21",
        "icon":"./img/chipadvisor/21-pedro-gutierrez.jpeg",
        "title": " Chip Review #21 - Pedro Gutiérrez, Málaga ",
        "content": " Malaga. Day one. Anyone who knows me would say that I am a man of the beach and no one can keep me away from getting a tan. After a few hours <i>catching some rays</i>, we naturally needed to eat. We came to this charming place next to the water on the beach. Very nice fish, which means something from me as I'm not too keen on fish that isn't fried. A fish came with chips. <img class=\"failed  wp-image-81 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/07/img-20180712-wa0000.jpeg\" > <ul> <li>Looks 3 - A different shape to the usual, but I can already see that they have been unevenly cooked.</li> </ul> <ul> <li>Taste 2 - You can instantly tell from the taste, too. Not cooked at a high enough temperature and not for long enough, causing the oil to seep into the chip.</li> </ul> <ul> <li>Texture 1 - As stated previously, the texture was ruined by the cooking process.</li> </ul> <ul> <li>Condiments 2 - Well salted, which gave the only flavour featured with these chips.</li> </ul> <ul> <li>Freshness 3 - They were ok, I guess. Estimated time from kitchen to table: 2 minutes..</li> </ul> Overall 2.5 - Another painfully average chip, I really must find a good one before I die from a starch overdose. Thankyou ",
        "rating": "2.5",
        "location": [
            {
                "name": "Pedro Gutiérrez",
                "address": "P.º Maritimo Antonio Machado, 2, Málaga",
                "lat": "36.702123333714034",
                "long": "-4.433504643273966"
            }
        ]
    },
    {
        "id": "22",
        "icon":"./img/chipadvisor/22-gottan-grill.jpg",
        "title": " Chip Review #22 - Gottan Grill Gourmet, Malaga ",
        "content": " Another chip tale from my time in Malaga. It had been a long day, I believe it was the last night we all spent together and we wanted meat. The restaurant we had booked (Tanos) completely screwed us over so we came to this place. Which also screwed us over with disappointingly slow service (it took 15 for them to ask what we wanted to drink). As it was a burger grill place, I ordered a burger and standard fries. And then these came. <img class=\" chipimg wp-image-83\" src=\"https://chipsreviewforu.files.wordpress.com/2018/07/20180714_231102.jpg\"> Apologies for the photo, it was dark. <ul> <li>Looks 3 - Apart from what they came in (wtf?!), the chips did look pretty good, with good colour.</li> </ul> <ul> <li>Flavour 4 - They were seasoned very well, with lots of flavours coming through.</li> </ul> <ul> <li>Texture 2 - What a surprise. The chips were soft and soggy. I still don't know if they were baked or fried, as they had the benefits of neither.</li> </ul> <ul> <li>Condiments 3 - They came with a nice spicy mayonnaise, which added a new dimension of flavour to the chips.</li> </ul> <ul> <li>Freshness 2 - The only reason I'm not rating this lower, is because it <i>is</i> possible to have less fresh chips.. But they were definitely sitting around for a long time.</li> </ul> Overall 3 - <strong>But wait! </strong>This isn't what I ordered! I ordered standard fries, not some sort of artisan potato. So I will take 1 point. <strong>Overall - 2</strong> Thankyou. ",
        "rating": "2",
        "location": [
            {
                "name": "Gottan Grill Gourmet",
                "address": "C. Antonio Soler, 5, Málaga",
                "lat": "36.70417432316588",
                "long": "-4.4343925706098"
            }
        ]
    },
    {
        "id": "23",
        "icon":"./img/chipadvisor/23-rocamar.jpg",
        "title": " Chip Review #23 - Chiringuito Rocamar, Malaga ",
        "content": " The final in my Malaga chip-trio and this one is a doozy. Featuring a restaurant that tried to kill us and very unfriendly waiters. Another beachside restaurant, but somehow higher rated on trip advisor than the other. Upon arrival I was immediately disappointed once again by the poor service. Anyway, I ordered a bit of pork which came with these... <img class=\" chipimg wp-image-86\" src=\"https://chipsreviewforu.files.wordpress.com/2018/07/20180715_150721.jpg\"> As soon as the food arrivef, the entire restaurant decided to blow over killing dozens. Not really, but somebody could have been hurt. Also, I got sand on my chips. <ul> <li>Looks 2 - I feel like a broken record, but I always say that they look undercooked.</li> </ul> <ul> <li>Flavour 2 - Another disappointment as they had barely any flavour and didn't please my tastebuds.</li> </ul> <ul> <li>Texture 1 - An already bad texture was further ruined by sand. I like my chips crispy, not granular.</li> </ul> <ul> <li>Condiments 1 - Sand is <strong><i>not</i></strong> a good seasoning.</li> </ul> <ul> <li>Freshness 4 - They were hot before the restaurant collapse incident.</li> </ul> Overall 2 - Don't come here, because you'll only be disappointed by the chips. Thankyou. ",
        "rating": "2",
        "location": [
            {
                "name": "Chiringuito Rocamar",
                "address": "P.º Maritimo Antonio Machado, Málaga",
                "lat": "36.70363430593102",
                "long": "-4.432319283624241"
            }
        ]
    },
    {
        "id": "24",
        "icon":"./img/chipadvisor/24-de-maria.jpg",
        "title": " Chip Review #24 - De María, Madrid ",
        "content": " I'm now in the United Kingdom, and I have little time to trial as many different establishments as possible. Yesterday, I was in Madrid however, and we went to a <i>very</i> posh Argentinean grill restaurant. The meat was delicious and succulent and I'd love to eat it again. You know the rules by now though...only the chips matter. <img class=\" wp-image-88 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/07/20180721_135254.jpg\" > Again, bit of a dodgy picture, but people look at me strangely when I take pictures of chips for some reason... <ul> <li>Looks 3 - They definitely looked better in real life, maybe I should invest in a high power camera.</li> </ul> <ul> <li>Flavour 3 - They were nice, not unpleasant. Good cook time.</li> </ul> <ul> <li>Texture 3 - On a plate alone, they would have been crisper, but obviously with the humidity from the eggs they were hampered.</li> </ul> <ul> <li>Condiments 3 - Egg yolk is a delicious accompaniment for chips and it served it's purpose well.</li> </ul> <ul> <li>Freshness 4 - No grumbles here either, estimated time from kitchen to table: 1 minute.</li> </ul> Overall 3.5 - A good average chip, nothing incredible but very pleasant. Thankyou. ",
        "rating": "3.5",
        "location": [
            {
                "name": "De María",
                "address": "C. Félix Boix, 5, Madrid",
                "lat": "40.46349495022043",
                "long": "-3.688256701358611"
            }
        ]
    },
    {
        "id": "25",
        "icon":"./img/chipadvisor/25-mcdonalds.jpg",
        "title": " Chip Review #25 - McDonald's, Livingstone ",
        "content": " My first chip experience in the UK, and wow is it a big one. McDonald's, aka Maccie D's, aka Ronaldo Marcelino's. Apparently famous for their <i>fries</i>, MDs has piqued my interest. The location in question... <img class=\" wp-image-90 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/07/20180725_164654.jpg\" > And the chips. <img class=\" wp-image-92 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/07/20180725_165434.jpg\"> Whilst they look good anyway, I do understand that it's possible that I could be eliminated by McDonald's if I go around spreading potato blasphemy. Anyway... <ul> <li>Looks 3 -Presentation is key here, and they did a good job. Would look much better if placed in the red chip receptacle used for medium fries.</li> </ul> <ul> <li>Flavour 4 - Flavour was good, strong potato and salt coming through. Very pleasing to tastebuds.</li> </ul> <ul> <li>Texture 3 - I actually believe that, if the chips were slightly thicker, they would be incredible. But alas, no. Not enough crisp.</li> </ul> <ul> <li>Condiments 4 - A liberal application of salt provides a great flavour enhancement.</li> </ul> <ul> <li>Freshness 5 - They were <strong>FRESH</strong>! An absolute wonder, as they were cooked right in front of my eyes. Time from kitchen to table: 15 seconds.</li> </ul> Overall 3.5 - A very good chip and I completely recommend getting some from your local McDonald's (please sponsor me), if they are fresh. Thankyou. ",
        "rating": "3.5",
        "location": [
            {
                "name": "McDonald's",
                "address": "Almondvale Blvd, Livingston, United Kingdom",
                "lat": "55.88360657731001",
                "long": "-3.516847314168573"
            }
        ]
    },
    {
        "id": "26",
        "icon":"./img/chipadvisor/26-king-fish.jpg",
        "title": " Chip Review #26 - King Fish, Gosport ",
        "content": " After being in the UK for a number of weeks, I have eaten an unhealthy amount of chips. In fact, I've got about 7 or 8 more reviews to do after this... So this was on my second night in England and this location was highly recommended and said the have 'the best chips in Gosport'. We'll see about that. <img class=\" wp-image-95 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/08/20180816_154922.jpg\"> King Fish. Has been in business for roughly two years or more, don't really know. I got some classic fish and chips. <img class=\" wp-image-96 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/08/20180801_1954141.jpg\" > <ul> <li>Looks 3 - I mean, they look ok, but there's something about their colour that makes me think they've been sitting there for hours.</li> <li>Flavour 4 - I won't lie though, they did taste <i>pretty</i> good. A nice potatoey taste and not bland.</li> <li>Texture 3 - They were very soggy in places and slightly crispy in others. Don't really appreciate soggy chips.</li> <li>Condiments 4 - The application of salt and vinegar was executed well, lifting the flavour of the chips.</li> <li>Freshness 5 - As I watched these chips fried before my eyes, I have no complaints here.</li> </ul> Overall 3.5 - If one is looking to have some chips, this is a decent place, nothing more, nothing less. Thankyou. ",
        "rating": "3.5",
        "location": [
            {
                "name": "King Fish",
                "address": "22 The Avenue, Gosport PO12 2JR, United Kingdom",
                "lat": "50.79246354174687",
                "long": "-1.1498491973844926"
            }
        ]
    },
    {
        "id": "27",
        "icon":"./img/chipadvisor/27-little-palace.jpg",
        "title": " Chip Review #27 - Little Palace, Gosport ",
        "content": " Three days later on my british travels I did what everyone has to do; go to the pub. The decent thing about this pub ( actually the only decent thing, the beer prices are disgusting ) is the Chinese takeaway next door. This takeaway features chicken in chilli salt, one of the best dishes in Gosport, but as we know, it's a about the chips. <img class=\" wp-image-99 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/08/20180804_230404.jpg\" > <ul> <li>Looks 4 - There's something very nice about these chips, they look very nice. I think it's the fact they put the same stuff that they put on the chicken.</li> <li>Flavour 4 - Hits of garlic and other automatic tastes give these chips a great unique effect.</li> <li>Texture 3 - Unfortunately, like most Chinese takeaways, they haven't quite mastered the art of frying chips. The result was a little disappointing.</li> <li>Condiments 4 - As mentioned before, the chunks of vegetables made things more interesting.</li> <li>Freshness 5 - Even with a mouth dulled by alcohol, these chips were hot af, so a 5 is definitely earned.</li> </ul> Overall 4 - The best chips from a place that doesn't do chips I've had so far, wholly recommend that you try them. Thankyou. ",
        "rating": "4",
        "location": [
            {
                "name": "Little Palace",
                "address": "45 Village Rd, Alverstoke, Gosport PO12 2LD, United Kingdom",
                "lat": "50.78515737346439",
                "long": "-1.1499424938004041"
            }
        ]
    },
    {
        "id": "28",
        "icon":"./img/chipadvisor/28-five-guys.jpg",
        "title": " Chip Review #28 - Five Guys, Portsmouth ",
        "content": "<blockquote>There was a young man from Kitts,\n\nWho really liked making chips,\n\nHe cut up a fry,\n\nBegan to cry,\n\nTears down from his face to his tits.</blockquote>\nAnother day in England and I naturally had to branch out and try some more tasty 'tots. I was meeting with a few of my siblings to go bowling. The entire plan failed as there was a queue bigger than heck. On the way out, this place caught my eye:\n\n<img class=\" wp-image-103 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/08/20180810_124219.jpg\">\n\nNow this place has become very popular recently completely out of nowhere (at least for me), and it has been highly rated for the quality of it's food. Particularly the chips. Double fried in peanut oil, I knew I had to test them.\n\n<img class=\" chipimg wp-image-104\" src=\"https://chipsreviewforu.files.wordpress.com/2018/08/20180810_123240.jpg\" >\n<ul>\n\t<li>Looks 5 - Yeah I know, they look like real potatoes with beautiful textures of fryness.</li>\n\t<li>Flavour 3 - The peanut oil gave them a different taste to the others that I've had before, but in the end they were nothing special.</li>\n\t<li>Texture 3 - There wasn't really a uniform fry across the chips which was a terrible shame considering they were apparently double fried.</li>\n\t<li>Condiments 4 - The dips were nice, featuring tomato sauce and Five Guys mayo, both good.</li>\n\t<li>Freshness 5 - They were lovely and fresh, I was watching the whole process. Lovely how the kitchen is visible.</li>\n</ul>\nOverall 4 - Again, a very decent chip. Only let down by taste and texture (which I guess are the most important features for the untrained). Recommended.\n\nThankyou.",
        "rating": "4",
        "location": [
            {
                "name": "Five Guys",
                "address": "Gunwharf Quays, Porsmouth",
                "lat": "50.795466915543514",
                "long": "-1.1077802632028748"
            }
        ]
    },
    {
        "id": "29",
        "icon":"./img/chipadvisor/29-1-giraffe.jpg",
        "title": " Chip Review #29 - Giraffe, Portsmouth ",
        "content": " <blockquote>I've always talked about them, I mean, what do you think that the 'c' stands for in E=mc^2? Energy equals mass times the number of chips squared. <i>Albert Einstein cerca 1952</i></blockquote> Another day, yet another chip review. This time I'm meeting more family members for lunch, and we are hungry and poor. This is where Giraffe comes in; half price burgers? Oh yes. <img class=\"failed  wp-image-109 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/08/20180814_130050.jpg\" > I ordered a bacon cheeseburger and my sister ordered a chicken burger or something. The important thing to take away from this is: <i><strong>the burgers came with different chips.</strong></i> <img class=\"failed  wp-image-110 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/08/20180814_1327372.jpg\" > Looks like it's gonna be a double bill, surprise. So I got the normal chips and it's time to judge them. <ul> <li>Looks 4 - They do look nice, possibly handcut (unlikely) but I do like how the skin is part of the chip.</li> </ul> <ul> <li>Flavour 2 - As usual, this is the part that always lets down, not a whole lot going on in the flavour department.</li> </ul> <ul> <li>Texture 2 - Again, not much going on... They really felt like mashed potato, no crunch at all.</li> </ul> <ul> <li>Condiments 3 - Fortunately, there were the classic british collection of sauces such as hp sauce and mayo.</li> </ul> <ul> <li>Freshness 3 - These had been sitting for some time before they came to me. Estimated time from kitchen to table 4 mins.</li> </ul> Overall 2.5 - Not really that good, and I wouldn't have them again. And the next... <img class=\"failed  wp-image-111 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/08/20180814_132740.jpg\"> My sister's look so much better. I think sweet potato fries are cheating though. <ul> <li>Looks 5 - As mentioned before. Look great.</li> </ul> <ul> <li>Flavour 4 - The flavour of these Sa-weet potats was such a step up from mine.</li> </ul> <ul> <li>Texture 4 - Smooth texture inside and fairly crispy on the out, a very good showing so far.</li> </ul> <ul> <li>Condiments 3 - Same condiments as mentioned before, so nothing new.</li> </ul> <ul> <li>Freshness 4 - Obviously my chips were sitting waiting for these to be done. Much hotter.</li> </ul> Overall 4 - A lovely chip, and I definitely suggest that you choose this variety of chip rather than the other. Thankyou. ",
        "rating": "4",
        "location": [
            {
                "name": "Giraffe",
                "address": "Gunwharf Quays, Porsmouth",
                "lat": "50.795466915543514",
                "long": "-1.1077802632028748"
            }
        ]
    },
    {
        "id": "30",
        "icon":"./img/chipadvisor/30-best-fry.jpg",
        "title": " Chip Review #30 - The Best Fry, Gosport ",
        "content": " Yet another review from my time in England. After this I think I only have three left...then I can start on the Spanish chips I've had. I thought I would be nice and take my brother to the park for some tennis. 8 mins later we were done and I was hungry yet again. We came here, a place that I had fond memories of years ago. <img class=\" wp-image-114 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/09/20180815_163732.jpg\"> The fact that the fryer wasn't on when I arrived should have been ample warning for me, but I was hungry enough to ignore it. <img class=\" wp-image-115 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/09/20180815_124551.jpg\"> <ul> <li>Looks 4 - A nice golden look, with uniformity.</li> <li>Flavour 2 - These chips had very little taste, so little that I hardly ate them.</li> <li>Texture 2 - The chips were sat there for ages before I came in. A very sad performance from this establishment.</li> <li>Condiments 1 - They had been salted. Once. From the other side of the room. Hardly any enhancement.</li> <li>Freshness 1 - Not fresh. Not good.</li> </ul> Overall 2 - Do not eat chips from this place, they aren't good. The best fry? More like the best lie <strong>Hahahaha.</strong> Thankyou. ",
        "rating": "2",
        "location": [
            {   
                "name": "The Best Fry",
                "address": "214 Anns Hill Rd, Gosport PO12 3RE, United Kingdom",
                "lat": "50.795965977294216",
                "long": "-1.148681537402702"
            }
        ]
    },
    {
        "id": "31",
        "icon":"./img/chipadvisor/31-wetherspoons.jpg",
        "title": " Chip Review #31 - Wetherspoons, Gosport ",
        "content": " In my penultimate experience in the lovely south of England, I go to Wetherspoons.<br><br>Sanctuary for the Sunday morning drunkards and the 18 year old bellends, Wetherspoons has established itself as literally the only place people on a normal income can afford to drink.<br><br>The food is another thing. Neither good nor bad, the microwaved dishes provide cheap sustenance for those on a binge.<br><br>The chips in question...<br><br><img class=\" wp-image-124 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/09/20180816_1219471.jpg\" /><br><ul><li>Looks 3 - Your bog standard chip. You won't get blown away by these, but you won't be disappointed either.</li></ul><ul><li>Flavour 4 - Ah, the wonderful taste of 'taters. They do taste nice.</li></ul><ul><li>Texture 3 - They weren't crispy, they never are... But they have some sort of texture that gives it a vaguely pleasant crunch.</li></ul><ul><li>Condiments 4 - With my favorite sauce mixture (Heinz ketchup, Hellmans mayonnaise, and HP sauce, in a 2:2:1 ratio. Try it), the taste was very good.</li></ul><ul><li>Freshness 4 - They came out of the fryer/microwave pretty quickly and were hot to the touch.</li></ul>Overall 4 - It's a worrying sign for society when a pubs chips, which are cooked in unidentifiable ways, with most likely inhumanely gathered potatoes, can be better than most other places. Think about it...<br><br>Thankyou. ",
        "rating": "4",
        "location": [
            {   
                "name": "Wetherspoons",
                "address": "28-29 High St, Gosport PO12 1DF, United Kingdom",
                "lat": "50.7954735012381",
                "long": "-1.1221487014355542"
            }
        ]
    },
    {
        "id": "32",
        "icon":"./img/chipadvisor/32-harvester.jpg",
        "title": " Chip Review #32 - Harvester, Portsmouth ",
        "content":  " I've managed to fall nearly 2 months behind in my reviews now but don't worry, I'm not dead or, at least not yet.This trip happened on a fine Sunday morning on the birthday of my friend/lover/black jesus. We had a lovely morning with a breakfast feast and workout.<img class=\" wp-image-129 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2018/10/20180819_103955.jpg\" />I had never even heard of harvester, let alone eaten there, but the bacon and eggs among other things were delicious. Now the chips.<img class=\" chipimg wp-image-128\" src=\"https://chipsreviewforu.files.wordpress.com/2018/10/20180819_100917.jpg\"  /><ul><li>Looks 3 - They look uniform and similar. That's not right, is it? How do you get chips to be the same size and shape?</li><li>Flavour 2 - They had very little flavour I'm afraid, just a hint of potato and that's it.</li><li>Texture 2 - Again, they really didn't have any texture, just old to be honest.</li><li>Condiments 3 - I believe there was HP sauce and ketchup, but no salt, so can't give high marks for that.</li><li>Freshness 3 - They were warm to be fair, but I think that the chips were being kept on a hot plate, to give the illusion of freshness.</li></ul>Overall 2.5 - Nothing special about the chip. Disappointing really, but I do recommend the eggs and bacon. ",
        "rating": "2.5",
        "location": [
            {   
                "name": "Harvester",
                "address": "15 The Boardwalk, Portsmouth PO6 4TP, United Kingdom",
                "lat": "50.84152441989142",
                "long": "-1.0965746253508297"
            }
        ]
    },
    {
        "id": "33",
        "icon":"./img/chipadvisor/33-bayside-cafe.jpg",
        "title": " Chip Review #33 - Bayside Café, Gosport ",
        "content":  " Welcome to my chip review I hope you enjoy it. My trip to Bayside café was anticipated. For two weeks I had been counting down the days until I could finally have the taste of their brie, chicken and cranberry sauce Panini once again but this is a review about chips so enough blabbering on about my Panini. My friend Rachael and I go out for lunch on Friday once every two weeks and as always when we eat at the Bayside cafe we ordered a bowl of…chips. Now this may not sound like much between us however as two college students £2.80 between us as well as out individual meals was all we could afford. My plate however already comes with chips, curly fries. These are not to my taste. Anyway our meals came out with not just one but two bowls of chips?! <img class=\" chipimg wp-image-134\" src=\"https://chipsreviewforu.files.wordpress.com/2018/11/45887234_1941720402798002_659662253171146752_n.jpg\" alt=\"45887234_1941720402798002_659662253171146752_n\"  /> There was clearly a mistake here but we were not going to let a free bowl of chips escape our mouths. So there in front of us were three portions of chips to taste. • Looks 3 –They just looked like chips in a white bowl. All different shapes and sizes however they didn’t look very crispy but that’s for the texture to decide. • Flavour 3- From the taste you could tell they were cooked in the fryer. They didn’t taste bad but it wasn’t amazing either. • Texture 2 – Personally the best texture for me is a good crisp on the outside and nice fluffy potato inside. These chips only had a slight crisp if lucky but it was acceptable. Inside however the potato was very dense but also fluffy? • Condiments 5 - There was a variety of sauces such as tomato sauce, mayo and sweet chilli sauce (a big range) jotted around the café as well as salt, pepper and vinegar. • Freshness 3 – You could tell they had just been fried which was good however personally I don’t think they look very homemade and with no mention of them being homemade this is what I shall assume. Overall 3.2 – Not the best chip in the world but it will do for when you get a little peckish whilst out having a walk down the beach. ",
        "rating": "3.2",
        "location": [
            {   
                "name": "Bayside Café",
                "address": "Stokes Bay Rd, Alverstoke, Gosport PO12 2QT, United Kingdom",
                "lat": "50.786443037582146",
                "long": "-1.169328366059786"
            }
        ]
    },
    {
        "id": "34",
        "icon":"./img/chipadvisor/34-la-vega.jpg",
        "title": " Chip Review #34 - La Vega, Cabra ",
        "content":  " This may or may not have happened three months ago. I am a very busy man, what with the musical I'm writing... and work i guess. It was a nice summer evening and I was hungry for burgers. Enter La Vega. It was a nice place, decent service and the burgers were very nice. Now the chips. <img class=\"chipimg\" data-wpid=\"71\" src=\"https://chipsreviewforu.files.wordpress.com/2018/12/20180821_212833.jpg\"> <ul> <li>Looks 3 - It's an interesting idea, to do slices instead of regular chips, but I'm not sure it works wholly in this instance.</li> </ul> <ul> <li>Flavour 3 - As usual, the flavour of bar chips is at best, average. They really needed some sort of seasoning.</li> </ul> <ul> <li>Texture 4 - Nice crisp, and a moderately fluffy center.</li> </ul> <ul> <li>Condiments 4 - They were very well salted, which is almost all you need in a chip. Almost.</li> </ul> <ul> <li>Freshness 5 - Lovely and fresh, not a moments wait from kitchen to plate.</li> </ul> Overall 3.75 - Very good texture and freshness, but it's the flavour that let's down. Thankyou ",
        "rating": "3.75",
        "location": [
            {   
                "name": "La Vega",
                "address": "Urbanizacion Poeta Manuel Ruiz Madueño, Bloque 1, 14940 Cabra, Córdoba",
                "lat": "37.47639550768409",
                "long": "-4.433277871746826"
            }
        ]
    },
    {
        "id": "35",
        "icon":"./img/chipadvisor/35-entre-tapas.jpg",
        "title": " Chip Review #35 - Entre Tapas, Cabra ",
        "content":  " The next site on our journey takes place in Cabra five months ago (oops) It was a nice night, I remember that much and we ventured to a place that is great if you really love the smell/taste of cigarettes while you eat. <img class=\"wp-image-144  chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/01/20180829_224812-1.jpg\"> Now for the chips, I began to test a new rating system during this time. I thought that smell may have a slight impact on overall enjoyment. However it didn't, so I wouldn't pay too much attention to it. <ul> <li>Looks 3 - They didn't look too bad, just a bit of a mess. Presentation is important.</li> <li>Smell 3 - Smelled like chips.</li> <li>Taste 3 - As you can tell, absolutely nothing special about these. Neither good nor bad.</li> <li>Texture 2 - Big let down on texture, very little crisp and they actually felt soggy. Big no no.</li> <li>Condiments 3 - They came with mayonnaise so that redeemed it slightly.</li> <li>Freshness 4 - Again, at least they were hot so it allowed me to eat them. After all, I was very hungry.</li> </ul> Overall 3 - Slap bang average again. I'm sure one day I'll encounter another good chip but until then, mediocrity. Thankyou ",
        "rating": "3",
        "location": [
            {   
                "name": "Entre Tapas",
                "address": "Pl. Vieja, 4, 14940 Cabra, Córdoba",
                "lat": "37.47154434993975",
                "long": "-4.445694942354486"
            }
        ]
    },
    {
        "id": "36",
        "icon":"./img/chipadvisor/36-taco-bell.jpg",
        "title": "  Chip Review #36 - Taco Bell, Malaga ",
        "content":  " Malaga is an interesting city. I've never been somewhere that is so English without actually being in England. Everyone speaks English and there are many fast food places. Taco Bell being one of them.I'm not really a big fan of Taco Bell but I feel obliged to make this review (5 months late). So here they are: <img class=\" wp-image-151 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/03/20190104_144939.jpg\"> <ul> <li>Looks 4 - They do look good I won't lie, I think it's all the spices added that give them a nearly exotic look.</li> </ul> <ul> <li>Taste 3 - Unfortunately the spices add very little actually in the form of flavour. Just as bland as always.</li> </ul> <ul> <li>Texture 3 - Not crunchy, yet not soft. Needed a longer fry.</li> </ul> <ul> <li>Condiments 1 - Excluding the spicy salt(?) I got nothing, not even tomato sauce.</li> </ul> <ul> <li>Freshness 4 - At least they were moderately hot. After a days travel I would have committed seppuku if they hadn't been.</li> </ul> Overall 3. Not worth trying unless you are about to die. I'll be coming back at you with some new chips soon, good or bad. Thankyou ",
        "rating": "3",
        "location": [
            {   
                "name": "Taco Bell",
                "address": "C.C. VIALIA, C. Explanada de la Estación, s/n, 29002 Málaga",
                "lat": "36.71204358072989",
                "long": "-4.432272490868825"
            }
        ]
    },
    {
        "id": "37",
        "icon":"./img/chipadvisor/37-bayside-cafe-2.jpg",
        "title": " Chip Review #37 - Bayside Café, Gosport (Again) ",
        "content":  " You may remember chip review #33 in which my lovely sister wrote an extremely detailed and entertaining review of the chips in this establishment. Well at Christmas time, I visited the place myself, well, the both of us. She recommend that I try the bacon and brie panini, which I wholeheartedly did - with added chicken of course. The panini came with chips. Curly fries. <img class=\" wp-image-153 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/05/20181228_125806.jpg\"> I haven't reviewed curly fries here before, so this is a bit of a novelty. However I must continue to give an honest and unbiased review. <ul> <li>Looks 4 I must admit, curly fries look amazing.</li> </ul> <ul> <li>Taste 3 The flavor of the chips were average.</li> </ul> <ul> <li>Texture 3 The chips had the texture of cardboard and were painful to eat.</li> </ul> <ul> <li>Condiments 4 They had tomato sauce, mayonnaise and hp sauce. Delicious.</li> </ul> <ul> <li>Freshness 5 The chips came immediately and they were very hot.</li> </ul> Overall 4 these chips were very good, they made me happy. This review is written by student. ",
        "rating": "4",
        "location": [
            {   
                "name": "Bayside Café",
                "address": "Stokes Bay Rd, Alverstoke, Gosport PO12 2QT, United Kingdom",
                "lat": "50.786443037582146",
                "long": "-1.169328366059786"
            }
        ]
    },
    {
        "id": "38",
        "icon":"./img/chipadvisor/38-budapest-1.jpg",
        "title": " Chip Review #38 - Budapest Special ",
        "content":  " <strong><u>Day One</u></strong> For something different, I will review as many chips as posible whilst in the Hungarian capital.Our first encounter takes us to a bar called... Összesítô... Maybe? I've ordered a burger and it comes with chips. <img class=\"chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/06/wp-1561817705479.jpg\"> <ul> <li>Looks 3 - What more can I say?</li> </ul> <ul> <li>Taste 3 - Maybe I am becoming Gordon Ramsay, but I really can taste when the chips are frozen.</li> </ul> <ul> <li>Texture 2 - Unevenly cooked; somehow they are raw and burnt at the same time.</li> </ul> <ul> <li>Condiments 2 - I had to order sauces which were decent enough.</li> </ul> <ul> <li>Freshness 4 - From my seat I could see them being fried, at least they weren't microwaved I guess.</li> </ul> Overall - 2.5O Our next place is called Escobar. It's a restaurant by the river and it's really expensive for what it is. The Hungarian speciality, paprika chicken, was underwhelming. As were these... <img class=\" wp-image-160 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/06/20190629_231617.jpg\"> <ul> <li> Looks 3 - They do have a more 'handcut' appeal, yet, I can see the under cooked-mess.</li> </ul> <ul> <li>Taste 2 - A generic potato taste and nothing more to say.</li> </ul> <ul> <li>Texture 2 - Not crunchy, but not soft. Worse than either possibility.</li> </ul> <ul> <li>Condiments 2 - Came with knockoff Heinz ketchup, had to apply salt myself.</li> </ul> <ul> <li>Freshness 4 - They were fresh enough to eat. If they had been cold, I wouldn't have bothered.</li> </ul> Overall - 2.5 <u><strong>Day Two</strong></u> Next day we are continuing with the reviews, I have a hunger that is going to be difficult to satiate. But let's try anyway. I'm in a restaurant called Magdalena Merlo. I got some sort of breaded meat, not bad at all. And obviously chips. <img class=\" wp-image-163 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/06/wp-1561900558854.jpg\"> Looks 2 - These chips looked anemic if nothing else. Perhaps my growing discontent of not having found decent chips was starting to lower my ratings further. Taste 2 - They were bland. Somehow didn't even taste of oil. Texture 1 - Soft and pasty. Not a single crisp in sight. Condiments 2 - They were salted, at least. Not that it did anything. Freshness 3 - They were fresh, yet cold. Not sure how that was possible really. Overall - 2 Worst of the bunch I'm afraid. <strong>So, </strong>not a great experience with chips here, which is a shame as the other food was nice. I had intended to find the Buda-best chips but instead I found the Buda-worst. Thankyou. ",
        "rating": "2.4",
        "location": [
            {   
                "name": "Budapest",
                "address": "Budapest",
                "lat": "47.49872662315674",
                "long": "19.035533116515232"
            }
        ]
    },
    {
        "id": "39",
        "icon":"./img/chipadvisor/39-el-poligono.jpg",
        "title": " Chip Review #39 - El Polígono Vado Hermoso, Cabra ",
        "content":  " Back to my usual routine of eating many chips in few days and then not eating them for ages. At the moment, I have many opportunities to try new chips so let's do this. Today I am eating in a restaurant that gives a ridiculous amount of food for the cost. <img class=\"wp-image-169  chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/07/wp-1562590863813.jpg\"> <ul> <li>Looks 4 - They seem homemade... Or do they? Whatever the truth is, they look nice with a golden glow.</li> <li>Taste 4 - These chips are a significant improvement on the chips I had last week. They have flavour!</li> <li>Texture 3 - This was a letdown though, very soft inside but not crispy at all.</li> <li>Condiments 4 - Salted, with alioli as a side. Very yummy.</li> <li>Freshness 4 - At first I gave these a 5, but realised quickly that they weren't actually that not.</li> </ul> Overall 3.75 - A good standard chip that satisfies hunger and taste. Thankyou. ",
        "rating": "3.75",
        "location": [
            {   
                "name": "El Polígono",
                "address": "Pol. Ind. Vado Hermoso, 29, 14940 Cabra, Córdoba",
                "lat": "37.472757053202685",
                "long": "-4.460371391245298"
            }
        ]
    },
    {
        "id": "40",
        "icon":"./img/chipadvisor/40-cafe-carbon.jpg",
        "title": " Chip Review #40 - Cafe Carbòn, Amsterdam ",
        "content":  " First day in Amsterdam and I'm excited to try the chips. However my day, or quite possibly my life, has been ruined by Federers loss at Wimbledon today. Oh well...let's see what we have...<img class=\" wp-image-172 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/07/wp-1563131123507.jpg\" /><ul><li>Looks 4 - They look nice. I can't believe I watched it for 5 hours to end like that.</li></ul><ul><li>Taste 3 - He had two match points. Two.</li></ul><ul><li>Texture 2 - I don't care, nothing's good enough to impress me now.</li></ul><ul><li>Condiments 3 - They had mayonnaise.</li></ul><ul><li>Freshness 5 - Very hot and fresh. Unlike Federer now.</li></ul>Overall - 3. I want to cry.Thankyou ",
        "rating": "3",
        "location": [
            {   
                "name": "Cafe Carbón",
                "address": "Van Woustraat 174, 1073 LX Amsterdam, Netherlands",
                "lat": "52.351868410584224",
                "long": "4.902888253377658"
            }
        ]
    },
    {
        "id": "41",
        "icon":"./img/chipadvisor/41-burger-fabriek.jpg",
        "title": " Chip Review #40 - Burger Fabriek, Amsterdam ",
        "content":  " I was recommended by my sister to try the wall chips, here we go. I have high expectations. I must say that Amsterdam is a very nice place and there is a lot of sex stuff around. Interesting for sure. Anyway, to the chips. <img class=\" wp-image-175 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/07/wp-1563190141809.jpg\"> <ul> <li>Looks 4 - They look very nice and golden... Apologies for the photo quality I was walking at the time.</li> </ul> <ul> <li>Taste 4 - A nice rich taste of potato and the oil used left a delicious aftertaste.</li> </ul> <ul> <li>Texture 3 - Not as crunchy as I would have liked but still soft inside.</li> </ul> <ul> <li>Condiments 3 - Only salt, other condiments costed more.</li> </ul> <ul> <li>Freshness 4 - Strangely, considering I saw them being cooked in front of me, they were not extremely hot. Strange.</li> </ul> Overall 3.75 - Better than the other chips I've tried here so far. But (at least) one more review to go. Thank you ",
        "rating": "3.75",
        "location": [
            {   
                "name": "Burger Fabriek",
                "address": "Nieuwendijk 142, 1012 MS Amsterdam, Netherlands",
                "lat": "52.375859343060974",
                "long": "4.895170062202031"
            }
        ]
    },
    {
        "id": "42",
        "icon":"./img/chipadvisor/42-at-james.jpg",
        "title": " Chip Review #42 - At James', Amsterdam ",
        "content":  " Lunch time before we leave to Germany, to try more chips. I am very tired from all of the walking and I really, really need to eat some potatoes. I have ordered endless ribs but of course we need to try the chips. <img class=\" wp-image-182 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/07/wp-1563276090102.jpg\"> <ul> <li>Looks 2.5 - These are the type of chip that are clearly pre order. Frozen. I can tell.</li> <li>Taste 2.5 - They tasted like chips that were pre made and frozen.</li> <li>Texture 2.5 - They had an almost false crisp. Soft sometimes.</li> <li>Condiments 2.5 - Salted. Tomato sauce and mayonnaise sachets provided but not utilised.</li> <li>Freshness 5 - They were piping hot which was nice, but I didn't really eat any of them.</li> </ul> Overall 2.5 - From this moment onwards, any low quality frozen chip will not get a score higher than 2.5 (50%) Thankyou ",
        "rating": "2.5",
        "location": [
            {   
                "name": "At James'",
                "address": "Damrak 45, 1012 LK Amsterdam, Netherlands",
                "lat": "52.37559103926081",
                "long": "4.895930104903621"
            }
        ]
    },
    {
        "id": "43",
        "icon":"./img/chipadvisor/43-akl.jpg",
        "title": " Chip Review #43 - AKL, Aachen ",
        "content":  " Yet another installment as I continue my travels across Europe. Today brings me to a typical Lebanese restaurant. So much cheaper than Amsterdam already. I've ordered a plate of meat and things - I didn't understand the menu. And it comes with these...<img class=\"chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/07/wp-1563369498960.jpg\"> <ul> <li>Looks 4 - A luscious golden colour, and especially with the added Lebanese spices. They definitely look appealing.</li> </ul> <ul> <li>Taste 2.5 - Unfortunately the flavour did not quite match the look. Not terrible, but not great.</li> </ul> <ul> <li>Texture 3 - A good crisp on the outside, but slightly too hard on the inside.</li> </ul> <ul> <li>Condiments 5 - I got three different sauces with it. Mayo, hummus and another sauce made by the restaurant. All delicious.</li> </ul> <ul> <li>Freshness 5 - These came out piping hot. Estimated time from kitchen to table; 30 seconds.</li> </ul> Overall 3 - A good chip which is overshadowed by the rest of the food. Still worth it. Thankyou ",
        "rating": "3",
        "location": [
            {   
                "name": "AKL",
                "address": "Pontstraße 1-3, 52062 Aachen, Germany",
                "lat": "50.77682428846945",
                "long": "6.083319083091099"
            }
        ]
    },
    {
        "id": "44",
        "icon":"./img/chipadvisor/44-kathys-frietnesse.jpg",
        "title": " Chip Review #44 - Kathy's Frietnesse, Aachen ",
        "content":  " Another day, another plate. Our location today is a slightly cheaper place on the street. I think I will eat a lot here. I'm ordering a currywurst, chicken wings and chips. These chips. <img class=\" wp-image-188 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/07/wp-1563560985795.jpg\" > <ul> <li>Looks 4 - Big, nice and thick. They soonish look like the ideal chip.</li> </ul> <ul> <li>Taste 2.5 - These chips are actually very similar to the English fish and chip shop equivalent. The oil was not fresh so I could taste everything else.</li> </ul> <ul> <li>Texture 3.5 - Some were perfect. Others had the texture of cardboard so not great really.</li> </ul> <ul> <li>Condiments 2.5 -They came with mayonnaise. Not 100% sure which brand but definitely not Hellmann's or Heinz.</li> </ul> <ul> <li>Freshness 4 - They were (re) fried very recently, but the cook neglected to tell me immediately.</li> </ul> Overall - 3 These were pleasant, especially to one as hungry as me...but I'm not sure they would have been as appreciated had I not been hungry.Thankyou. ",
        "rating": "3",
        "location": [
            {   
                "name": "Kathys Frietnesse",
                "address": "Pontstraße 101-105, 52062 Aachen, Germany",
                "lat": "50.77965569095625",
                "long": "6.080359022833038"
            }
        ]
    },
    {
        "id": "45",
        "icon":"./img/chipadvisor/45-hans-im-gluck.jpg",
        "title": " Chip Review #45 - Hans im Glück, Cologne ",
        "content":  " On my penultimate day in Germany I have travelled to Cologne, a very nice city with a very big cathedral. We went all the way to the top (something like 522 steps... easy) After walking around for some time we find ourselves looking for food. I feel like burgers. So here we are. Comes with chips of course. <img class=\" wp-image-193 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/07/wp-1563711623780.jpg\" > <ul> <li>Looks 4 - These look very nice. They kept the skins of the potatoes, giving it a great appearance.</li> </ul> <ul> <li>Taste 4 - A rich potato smell, accompanied by the aftertaste of the frying oil.</li> </ul> <ul> <li>Texture 4 - Nearly perfect, to be honest. The interior texture had the ideal softness. The outside of the chip could have been a little more crispy.</li> </ul> <ul> <li>Condiments 5 - A platitude of sauces; BBQ, ketchup, mayo and orange-mustard. Sehr Gut!</li> </ul> <ul> <li>Freshness 5 - They came out very fresh and hot.</li> </ul> <ul> <li>Value for money 5 - Came free with the meal so can't complain at all.</li> </ul> Overall 4.25 - The best chips I've eaten outside of Spain so far. Highly recommended if you are in Germany. The burgers are also good.Thankyou ",
        "rating": "4.25",
        "location": [
            {   
                "name": "Hans Im Gluck",
                "address": "Hohenzollernring 38-40, 50672 Köln, Germany",
                "lat": "50.938829546985694",
                "long": "6.939855289863116"
            }
        ]
    },
    {
        "id": "46",
        "icon":"./img/chipadvisor/46-taberna-corredera.jpeg",
        "title": " Chip Review #46 - Taberna Corredera, Córdoba ",
        "content":  " It's a very very very very <strong>very</strong> warm day. My sister and I are visiting Córdoba so she can see the sights (and taste the chips). As a special treat for you we have decided to both write a review of these chips. Let's see who is more generous.... <blockquote>Once again, I Saffron Farrell Horne am doing a chip review. This journey started on the 26th of July when I set off to visit my brother in spain. I have tried an array of chips so finally I have given in to the temptation to write my criticism. Not only has it been hot but it’s hotter while walking so we decided to stop off at Taberna Corredera. Straight away I knew I wanted... Some chips and a Fanta orange so that’s what I ordered. I waited and waited. Sure it might have felt longer in the sun but how long does it take to make some chips. During this time many questions gloomed upon me like will they have enough sauce for me and what the fuck am I doing with my future. We asked where our chips were ‘you haven’t ordered any’. We definitely had. It was clear to see the waiter was far to distracted by talking about his life to everyone and that this restaurant was not off to a good start.</blockquote> <img src=\"https://chipsreviewforu.files.wordpress.com/2019/08/received_2394243223945738.jpeg\" class=\" wp-image-202 chipimg\" > <h2>Looks</h2> <ul> <li>Taylor 3/5 - A very uninspiring look. Not golden which shows they are under-fried. As made evident by the texture.</li> </ul> <ul> <li>Saffron 3/5 - The chips entered our peripheral vision. I’m not sure what to make of these chips they came out with no salt and they are yellow. This set aside, I can see a crunchy outside which is my favourite.</li> </ul> <h2>Taste</h2> <ul> <li>Taylor 3/5 - They tasted of chips, although the salt tasted nicer than the chips themselves.</li> </ul> <ul> <li>Saffron 4/5 - Although i’m not a fan of the other criteria’s I am a fan of the taste. Some are a lot better than others however it could be a lot worse. Also something has to be going for these chips otherwise they’d be pure shit.</li> </ul> <h2>Texture</h2> <ul> <li>Taylor 2/5 - I would say that around 10% of the chips were crispy and about 10% of the chips were still raw. Which leaves 80% of chips average.</li> </ul> <ul> <li>Saffron 3/5 - I misjudged. They were soft. Don’t get me wrong it was a nice softness it felt as if i were to bite through a cloud but i am one for crunch.</li> </ul> <h2>Condiments</h2> <ul> <li>Taylor 1/5 - Had to salt them myself, and the ketchup and mayo sachets were warm and awful. Big no no.</li> </ul> <ul> <li>Saffron 1/5 - We were given a plate of warm cheap looking sauce sachets. Tomato sauce and mayo. So being me I asked for some BBQ sauce. No. No BBQ sauce. I’m afraid I love my sauces too much and this was a big set back for me resulting in me scoring this a 2. One per type. Later on after trying the sauces which tasted like vinegar I decided to change it to a 1</li> </ul> <h2>Freshness</h2> <ul> <li>Taylor 4/5 - After forgetting our order, they did eventually come out quickly and warm.</li> </ul> <ul> <li>Saffron 3/5 - The chips are hot. As I don’t do this often, I can’t tell how old the chip itself is. But what is certain is they were fried (underfried but still fried) within the last five minutes.</li> </ul> <h2>Price/Value for money</h2> <ul> <li>Taylor 1/5 - Well, for the price of €4.50, and the fact they forgot our order, not great at all. These are the quality of chips you would get for free with a meal.</li> </ul> <ul> <li>Saffron 2/5 - I think for 4.50€, these chips, the sauce and every thing else could’ve been a lot nicer. Rest assured I will never get them from here again.</li> </ul> <h2>Overall</h2> <ul> <li>Taylor - <em>One point penalty for forgetting order. </em><strong>1.5/5 </strong>I would not eat chips here. Not good.</li> </ul> <ul> <li>Saffron <strong>2.6/5 </strong>- I was in the mood for some good crunchy on the outside but fluffy on the inside chips. I had hope but i was disappointed. A normal feeling however throughout my day to day life.</li> </ul> <h5>Thankyou.</h5> ",
        "rating": "1.5",
        "location": [
            {   
                "name": "Taberna Corredera",
                "address": "Pl. de la Corredera, 35, 14002 Córdoba",
                "lat": "37.88331602277078",
                "long": "-4.774766552898745"
            }
        ]
    },
    {
        "id": "47",
        "icon":"./img/chipadvisor/47-hard-rock-cafe.jpg",
        "title": " Chip Review #47 - Hard Rock Cafe, Malaga ",
        "content":  " On another uncomfortably hot day, I am in Malaga to experience the feria (for 3 hours) and of course the chips of this fine establishment. I'd never been to a hard rock cafe before, but the inside was very interesting. Lots of memorabilia from some of music's best known (but not best) artists. Anyway, the chips. <img class=\" wp-image-204 chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/08/wp-1566051832927.jpg\"> <ul> <li>Looks 3 - I don't know why I rated these a 3, they clearly look wrong. Not golden brown, but grey.</li> </ul> <ul> <li>Taste 2.5 - Did not taste great, I'm assuming old oil.</li> </ul> <ul> <li>Texture 2 - These chips were... I want to say stodgy. Not great at all.</li> </ul> <ul> <li>Condiments 2 - Classic stuff provided; salt, pepper etc, but, did nothing to help the flavour.</li> </ul> <ul> <li>Freshness 4 - At least they were hot.</li> </ul> Overall - 2.5. I don't think I'll eat chips here again, for the price I paid I'm not impressed. Thankyou. ",
        "rating": "2.5",
        "location": [
            {   
                "name": "Hard Rock Cafe",
                "address": "P.º del Muelle Uno, 1, 29016 Málaga",
                "lat": "36.71827307538985",
                "long": "-4.412773045269381"
            }
        ]
    },
    {
        "id": "48",
        "icon":"./img/chipadvisor/48-mirador-almendros.jpg",
        "title": " Chip Review #48 - El Mirador de los Almendros - Priego ",
        "content":  " On a wet Sunday we ventured into priego in an attempt to visit the local agricultural fair. We were late, however, so the only possible option was to eat. An asador is normally a good place for food as they use rotisserie ovens for the chicken. For that I've ordered chicken and chips. Well that's just about when everything went wrong. The waiters were lazy, it took 15 minutes to order a single glass of wine and <strong>my entire chicken turned out to be half a chicken. Raw.</strong> Clearly we won't be coming back but let's give the chips a fair review anyway... <img class=\"chipimg\" src=\"https://chipsreviewforu.files.wordpress.com/2019/09/wp-1569158104203.jpg\"> <ul> <li>Looks 4 - Ok, they look pretty good. I'm always a sucker for golden brown.</li> </ul> <ul> <li>Taste 3 - They were ok, decent flavour I suppose. Would have liked for some of the more natural potato flavour to come through.</li> </ul> <ul> <li>Texture 3 - Some crispy, some not. Story of my life.</li> </ul> <ul> <li>Condiments 4 - I got alioli so I was happy. Can't go wrong really.</li> </ul> <ul> <li>Freshness 4 - To my complete and utter disbelief, these chips came out hot. Considering everything else this must have been a miracle.</li> </ul> Overall 3.5 - I can't believe I'm going to say this, but if you are in the area, you should try these chips. Avoid everything else though. ",
        "rating": "3.5",
        "location": [
            {   
                "name": "Mirador de los Almendros",
                "address": "C/ Maria Loreto Calvo Lozano 14800, Córdoba",
                "lat": "37.44071821014927",
                "long": "-4.216421161126078"
            }
        ]
    },    
    {
        "id": "49",
        "icon":"./img/chipadvisor/49-bar-bubion.jpg",
        "title": " Chip Review #49 - Bar Bubión, Granada ",
        "content":  " I'm about to get really drunk with some students so obviously we are eating tapas. I ordered a beer which is pretty good actually and here comes the tapas, it's chicken with chips.<img class=\"failed chipimg\" src=\"/storage/emulated/0/DCIM/Camera/20191219_220603.jpg\" /><ul><li>Appearance 4 - They do look very appealing but maybe it's the fact I'm very hungry.</li><li>Texture 5 - They are crispy as fuck!! Absolutely amazing!!!</li><li>Taste 3 - On the taste side of things they are rather lacking but the crisp(!) makes up for it.</li><li>Condiments 3 - They don't have much salt but there is alioli. Very niice.</li><li>Freshness 5 - I'm standing about 2 metres away from the fryer so they are very very fresh.</li></ul>Overall 4 - If you like chips, you need to come here to experience the <strong>crisp.</strong><em>Making an update the day after, these crispy chunks of goodness are the only reason I wasn't violently sick last night/today. Try these chips.</em> ",
        "rating": "4",
        "location": [
            {   
                "name": "Bar Bubion",
                "address": "Gta. de Arabial, 6, 18003 Granada",
                "lat": "37.17454392005066",
                "long": "-3.609483729801585"
            }
        ]
    },    
    {
        "id": "50",
        "icon":"./img/chipadvisor/50-fosters-2.jpg",
        "title": " Chip Review #50 - Fosters Hollywood, Malaga ",
        "content":  " <!-- wp:paragraph --> Chip Review is back! Now we are in a post lockdown world (until the next one), it's time to get back to what I do best; eat chips. <!-- /wp:paragraph --> <!-- wp:paragraph --> Fosters. An interesting place. Last time I was here I had cold chips and bland ribs, so let's hope today bodes better. <!-- /wp:paragraph --> <!-- wp:image {\"id\":224,\"sizeSlug\":\"large\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2020/08/wp-1596548159108.jpg?w=572\" alt=\"\" class=\"wp-image-224\" /><figcaption>Interesting table graffiti...</figcaption></figure> <!-- /wp:image --> <!-- wp:paragraph --> Here come the chips. I've been salivating at the thought of cramming salty potatoey goodness into my mouth once more! <!-- /wp:paragraph --> <!-- wp:image {\"id\":226,\"sizeSlug\":\"large\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2020/08/wp-1596549813993.jpg?w=572\" alt=\"\" class=\"wp-image-226\" /></figure> <!-- /wp:image --> <!-- wp:list --> <ul><li>Looks 2 - The photo actually does them justice. In reality they looked pathetically anemic.</li></ul> <!-- /wp:list --> <!-- wp:list --> <ul><li>Taste 3 - They had the typical flavour of wholesale restaurant chips.</li></ul> <!-- /wp:list --> <!-- wp:list --> <ul><li>Texture 2 - A sorry texture of nothingness. Occasionally there was a hint of crisp...but nothing more.</li></ul> <!-- /wp:list --> <!-- wp:list --> <ul><li>Condiments 3 - There was a strange sauce, I had no idea what the flavour was but it was better than the chips.</li></ul> <!-- /wp:list --> <!-- wp:list --> <ul><li>Freshness 3 - Had these chips been cooked the right amount of time, they may still have been hot. But being undercooked, they were passing into the realm of cold by the time they hit my plate.</li></ul> <!-- /wp:list --> <!-- wp:paragraph --> Overall 2.5 - To be fair, the burger was nice. The chips weren't. So, if you are a chip aficionado like me, stay away. <!-- /wp:paragraph --> <!-- wp:paragraph --> Thankyou <!-- /wp:paragraph --> ",
        "rating": "2.5",
        "location": [
            {   
                "name": "Fosters Hollywood",
                "address": "C.C. Vialia, s/n, 29002 Málaga",
                "lat": "36.711424929631825",
                "long": "-4.433867749550725"
            }
        ]
    },    
    {
        "id": "51",
        "icon":"./img/chipadvisor/51-bodega-pepe.jpg",
        "title": " Chip Review #51 - Bodega Pepe, Frigiliana ",
        "content":  " <!-- wp:paragraph --> This summer brings us to a lovely mountain town called Frigiliana. Apart from hardly anyone here knowing how to wear a mask (global pandemic anyone???) It is a sight to behold. <!-- /wp:paragraph --> <!-- wp:paragraph --> Unfortunately we somehow made the worst decision possible for food and came to this establishment. If you like microwaved food served for €15 a plate, you'll love this place <!-- /wp:paragraph --> <!-- wp:image {\"id\":228,\"sizeSlug\":\"large\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2020/08/wp-1597349695201.jpg\" alt=\"\" class=\"wp-image-228\" /></figure> <!-- /wp:image --> <!-- wp:paragraph --> Looks 2 - Classic supermarket chips. Obvious they don't know how to use a fryer, only a microwave. <!-- /wp:paragraph --> <!-- wp:paragraph --> Texture 2 - The texture you would expect from shop bought chips. <!-- /wp:paragraph --> <!-- wp:paragraph --> Taste 1 - There wasn't any. No salt. <!-- /wp:paragraph --> <!-- wp:paragraph --> Condiments 2 - There was the sauce of the 'mains' we ordered, which had marginally more flavour. <!-- /wp:paragraph --> <!-- wp:paragraph --> Freshness 4 - The only hot thing on the plate. <!-- /wp:paragraph --> <!-- wp:paragraph --> Overall 2 - Don't come here. <!-- /wp:paragraph --> ",
        "rating": "2",
        "location": [
            {   
                "name": "Bodega Pepe",
                "address": "Calle El Portón, s/n, 29788 Frigiliana, Málaga",
                "lat": "36.79163339283196",
                "long": "-3.896115992294422"
            }
        ]
    },    
    {
        "id": "52",
        "icon":"./img/chipadvisor/52-cabana-canario.jpg",
        "title": " Chip Review #52 - La Cabaña del Canario, Torrox ",
        "content":  " <!-- wp:paragraph --> Another day to try chips, another bar where no waiter wears a mask. Hmm... Anyway, here come the chips. <!-- /wp:paragraph --> <!-- wp:paragraph --> Not going to lie, everything was very nice here but of course our main focus is the crispy potato goodness. <!-- /wp:paragraph --> <!-- wp:image {\"id\":233,\"sizeSlug\":\"large\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2020/08/20200814_151035.jpg?w=572\" alt=\"\" class=\"wp-image-233\" /></figure> <!-- /wp:image --> <!-- wp:paragraph --> Looks 4 - They were a lovely golden colour, very inviting indeed. <!-- /wp:paragraph --> <!-- wp:paragraph --> Texture 4 - Woah my god, they were <em><strong>crispy. </strong></em>It really shouldn't be a positive that people can fry chips well... It should be a given. <!-- /wp:paragraph --> <!-- wp:paragraph --> Taste 3 - A mediocre taste was presented to my taste buds which, considering the looks and texture, is a disappointment. <!-- /wp:paragraph --> <!-- wp:paragraph --> Condiments 4 - There was a delicious alioli that enhanced every single chip that was blessed by it's contact. <!-- /wp:paragraph --> <!-- wp:paragraph --> Freshness 3 - Estimated time from kitchen to table: 3 minutes. Still warm though. <!-- /wp:paragraph --> <!-- wp:paragraph --> Overall 3.5 - If you are looking for a nice place by the sea to eat, this is it. If you are looking for the perfect chip, this isn't it. <!-- /wp:paragraph --> <!-- wp:paragraph --> Thank you <!-- /wp:paragraph --> ",
        "rating": "3.5",
        "location": [
            {   
                "name": "Cabaña del Canario",
                "address": "Av. del Peñoncillo, 43, 57, 29770 Torrox, Málaga",
                "lat": "36.73217659520407",
                "long": "-3.9440069343566218"
            }
        ]
    },    
    {
        "id": "53",
        "icon":"./img/chipadvisor/53-hacendado-4.jpg",
        "title": " Chip Review #53 - Hacendado, Mercadona ",
        "content":  " <!-- wp:paragraph --> In my never ending quest to discover the perfect chip, I have decided to widen my search to include chips from the supermarket. Whilst I have made claims that most of the chips I have eaten are from shops, it's time to put that theory to the test. <!-- /wp:paragraph --> <!-- wp:image {\"id\":236,\"sizeSlug\":\"large\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2020/08/wp-1597925450454.jpg?w=572\" alt=\"\" class=\"wp-image-236\" /></figure> <!-- /wp:image --> <!-- wp:paragraph --> Here they are. I had a choice of many different cuts; thin, thick, wavy... But I feel the best way to see this is by sticking to basics. <!-- /wp:paragraph --> <!-- wp:paragraph --> I will also follow the instructions as stated on the pack so, if you don't speak Spanish here they are. <!-- /wp:paragraph --> <!-- wp:image {\"id\":237,\"sizeSlug\":\"large\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2020/08/wp-1597925481752.jpg?w=572\" alt=\"\" class=\"wp-image-237\" /><figcaption><em>Fry the chips, in small quantities in abundant hot oil(175°c) 3-4 mins. Remove the oil and season to taste</em>. <em>Drain well before serving.</em></figcaption></figure> <!-- /wp:image --> <!-- wp:image {\"id\":238,\"sizeSlug\":\"large\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2020/08/wp-1597926221389.jpg?w=572\" alt=\"\" class=\"wp-image-238\" /><figcaption>So these are the chips after 4 minutes. Honestly they don't look done. I think I will cook them for a few more minutes. </figcaption></figure> <!-- /wp:image --> <!-- wp:image {\"id\":239,\"sizeSlug\":\"large\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2020/08/wp-1597926564944.jpg?w=572\" alt=\"\" class=\"wp-image-239\" /><figcaption>And here they are! After 7 minutes of frying.</figcaption></figure> <!-- /wp:image --> <!-- wp:paragraph --> Looks 3 - They do have a golden brown colour, but of course they lack the appearance of a higher quality chip. <!-- /wp:paragraph --> <!-- wp:paragraph --> Texture 4 - I admit it, the texture was pretty much perfect. Crispy outside, fluffy inside. The only let down was that the chips seemed rather hollow, that is, they lacked filling. <!-- /wp:paragraph --> <!-- wp:paragraph --> Taste 2 - Yeah, not amazing. Not surprisingly, they taste like store bought chips. <!-- /wp:paragraph --> <!-- wp:paragraph --> Condiments 4 - I only had salt and basic mayonnaise, but they served the chip well. <!-- /wp:paragraph --> <!-- wp:paragraph --> Freshness 5 - Obviously they were super fresh as there was no time waiting to be served. <!-- /wp:paragraph --> <!-- wp:paragraph --> Overall 3.5 (2.5 if cooked following instructions) Not too bad, I recommend cooking longer than stated. But definitely not the best chips I've eaten. <!-- /wp:paragraph --> <!-- wp:paragraph --> Thankyou <!-- /wp:paragraph --> ",
        "rating": "3.5",
        "location":[
            {
                "name": "Hacendado"
            }
        ]
    },    
    {
        "id": "54",
        "icon":"./img/chipadvisor/54-shawarmita-3.jpg",
        "title": " Chip Review #54 - Shawarmita, Granada ",
        "content":  "So I have finally gotten round to reviewing a place that I have visited an average of once a week for the last 2 years (and a few years before, too). This place is a must check out for anyone who visits the city, especially for those of the potato persuasion. It could well be the best place in Granada for \"loaded\" chips, and it definitely was in the past. There is a new guy at the moment and he is getting better, but right now its not <em>quite</em> as good as before. <br> I starved myself today in order to pig out on 2 different forms of chip. The normal, and the superb. Lets start with the normal chips... <!-- /wp:paragraph --> <!-- wp:gallery {\"ids\":[262],\"linkTo\":\"none\"} --> <figure class=\"wp-block-gallery columns-1 is-cropped\"><ul class=\"blocks-gallery-grid\"><li class=\"blocks-gallery-item\"><figure><img src=\"https://chipsreviewforu.files.wordpress.com/2021/05/195645419_222264202784726_4658396933765592631_n.jpg?w=448\" alt=\"\" data-id=\"262\" data-link=\"https://chipsreviewforu.wordpress.com/195645419_222264202784726_4658396933765592631_n/\" class=\"wp-image-262\" /></figure></li></ul></figure> <!-- /wp:gallery --> <!-- wp:paragraph --> I should be a photographer with that quality... Lets talk about these then.<br><br>Looks 3 - They honestly don't look great, if anything the photo makes them look worse. But in reality, they do look somewhat inviting.<br><br>Texture 3.5 - They are not the crispiest chip in the world. They do have something about them though... they are at least uniform in their crisp; none of this weird soggy plus crispy combo. All were slightly crispy.<br><br>Taste 4 - Here we go. The chips themselves have a light potatoey flavour and that in addition to the lightly sprinkled salt, they do have a wonderful taste. Add the white sauce and we have a winner, bloody lovely.<br><br>Condiments 4 - The white sauce, as mentioned before, is lovely and it raises the quality of anything it touches.<br><br>Freshness 4 - I saw them come out of the fryer and go in the box. Unfortunately I took some time to take them home and eat so that does have an impact on freshness and texture, of course.<br><br>Value for money 4 - They costed me €1.50 and, honestly, that's pretty good I guess. Its just that, why would anyone just get chips when they could get the chips with meat...<br><br>Overall 3.5 - Can't really go wrong with these if you are peckish for a little starchy snack. I would seriously recommend the next thing however. <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2021/05/195357427_4103944916337823_3335488385626536038_n.jpg?w=816\" alt=\"\" class=\"wp-image-264\" />This is the one, the one I get every time I want some chips. It is quite possibly the best fast food here. Chips. Chicken. White sauce, Spicy sauce. Perfection.<br><br>Looks 4 - It makes me happy every time I see this tray of decadent food in front of me. It looks filling. It is.<br><br>Flavour 5 - I said it. It's a 5. You cannot get better than this, or, I haven't quite found it yet. It is the best tasting tray of chips and stuff you can find.<br><br>Texture 3.5 - The texture of the chips themselves suffers from all of the sauce and condensation, but they still maintain a fragment of the crispiness that I so desire.<br><br>Condiments 4.5 - The white sauce is great. We have already established that. The addition of spicy sauce merely compliments the taste further. There is very occasionally a third sauce that they have which would take it to a 5, but today was not that day.<br><br>Freshness 4 - Same case as before, I saw them make it and prepare it and everything, but after taking it home, it was not quite as hot as it could/should have been.<br><br>Value for money 5 - This cost me €6 and it is more than enough for a meal. The €5 tray is probably enough for even the hungriest of people.<br><br>Overall 4.5 - Extremely highly recommended. Try them if you can. Regret not trying them if you can't.",
        "rating": "4.5",
        "location": [
            {   
                "name": "Shawarmita",
                "address": "Calle Dr. Fleming, 6, 18012 Granada",
                "lat": 37.190270383417804,
                "long": -3.6084238832609996
            }
        ]
    },    
    {
        "id": "55",
        "icon":"./img/chipadvisor/55-kfc-2.jpeg",
        "title": " Chip Review #55 - KFC, Malaga ",
        "content":  " <!-- wp:quote --> <blockquote class=\"wp-block-quote\">I will definitely do more than one post this year<cite>Me, 2021</cite></blockquote> <!-- /wp:quote --> <!-- wp:paragraph --> A new year comes about, and with it a renewed vigor for hunting down the perfect chip. I know that I have been slightly AWOL since before the pandemic, and I apologise. Once more shall I set out on this quest. Once more shall I eat more chips than the average American and once more I shall tell you how good they are. <!-- /wp:paragraph --> <!-- wp:paragraph --> I went to Malaga a week ago. Well to be honest I travelled through Malaga on the way home. As I was waiting for a connecting bus, I realised that I was indeed rather peckish. Where should I go? Hmmm. <!-- /wp:paragraph --> <!-- wp:image {\"id\":293,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2022/01/intro-1582143676.jpg?w=1000\" alt=\"\" class=\"wp-image-293\" /></figure> <!-- /wp:image --> <!-- wp:paragraph --> KFC is one of those places where you forget why you haven't visited in years and the moment that the greasy chicken touches your hands and lips, you instantly remember. Oh. Yeah. That's why. <!-- /wp:paragraph --> <!-- wp:gallery {\"linkTo\":\"none\"} --> <figure class=\"wp-block-gallery has-nested-images columns-default is-cropped\"><!-- wp:image {\"id\":292,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2022/01/whatsapp-image-2022-01-19-at-10.12.31.jpeg?w=768\" alt=\"\" class=\"wp-image-292\" /></figure> <!-- /wp:image --></figure> <!-- /wp:gallery --> <!-- wp:paragraph --> Not the greatest photo of chips I have made to be honest, but I think you can get the idea. <!-- /wp:paragraph --> <!-- wp:paragraph --> Looks 3.5 - The photo does no give them justice but they really did have a nice golden tinge. This is starting to become a trend. Maybe I need a better camera... <!-- /wp:paragraph --> <!-- wp:paragraph --> Texture 4 - A lovely crispy texture upon biting into this lovely treats. I would have liked for there to be more substance to the chip as in, a greater density, but of course we cannot have everything. <!-- /wp:paragraph --> <!-- wp:paragraph --> Taste 4 - They were very nice! How surprising for a fast food establishment that typically bathes all of its products in grease. <!-- /wp:paragraph --> <!-- wp:paragraph --> Condiments 3 - This was a little bit disappointing if I'm honest, I would have liked at least the possibility of using ketchup, mayonnaise or BBQ sauce. <!-- /wp:paragraph --> <!-- wp:paragraph --> Freshness 5 - I was the first person to order chips as they opened, so the chips were made in front of my own very eyes. Could not ask for more. <!-- /wp:paragraph --> <!-- wp:paragraph --> Overall 3.5 - If you are in the area, and are in need of something hot, salty and crispy; give this place a chance. You may be surprised. <!-- /wp:paragraph --> <!-- wp:paragraph --> Thankyou <!-- /wp:paragraph --> ",
        "rating": "3.5",
        "location": [
            {   
                "name": "KFC",
                "address": "C. Héroe de Sostoa, 2, 29002 Málaga",
                "lat": "36.711992317536165",
                "long": "-4.433141371435857"
            }
        ]
    },    
    {
        "id": "56",
        "icon":"./img/chipadvisor/56-popeyes.jpeg",
        "title": " Chip Review #56 - Popeye's, Granada ",
        "content":  " <!-- wp:paragraph --> I'm back! And this time, something I have never encountered in Europe before. Apparently Popeye's is an American establishment that is very similar to KFC. In fact it was very similar in that all of its chicken was moderately dry and tasteless. <!-- /wp:paragraph --> <!-- wp:paragraph --> I ate this after watching Lord of the Rings - The Fellowship of the Ring at the cinema ( AMAZING, by the way ), and after three hours of sitting down eating popcorn I really needed some starchy goodness. <!-- /wp:paragraph --> <!-- wp:image {\"id\":302,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2022/01/whatsapp-image-2022-01-19-at-10.12.31-1.jpeg?w=768\" alt=\"\" class=\"wp-image-302\" /></figure> <!-- /wp:image --> <!-- wp:paragraph --> Looks 5 - They do look bloody marvelous. A lovely golden brown with suggestions of a lovely spicy undertone. <!-- /wp:paragraph --> <!-- wp:paragraph --> Taste 3 - Like all chips tend to do, they look good but are in the end deceiving as they lack any sort of flavour. These chips didn't really taste of much except the idea of cajun. There was a bit of potato in there, but mostly stodge instead of starch. <!-- /wp:paragraph --> <!-- wp:paragraph --> Texture 2.5 - They had a type of stale texture to them, as if the crisp was artificial. I did not really enjoy biting into these things, yet there were a number of good chips in the horde of mediocrity. <!-- /wp:paragraph --> <!-- wp:paragraph --> Condiments 3 - As mentioned before, they were \"spiced\" with cajun seasoning, but not nearly enough to actually give the chips any special meaning. <!-- /wp:paragraph --> <!-- wp:paragraph --> Freshness 3 - They were not very fresh, either. I wish that they were at least hot because they would have been pleasing with the double combination of hot and spicy. <!-- /wp:paragraph --> <!-- wp:paragraph --> Overall 3 - Don't waste your time on these. <!-- /wp:paragraph --> <!-- wp:paragraph --> Thankyou <!-- /wp:paragraph --> ",
        "rating": "3",
        "location": [
            {   
                "name": "Popeyes",
                "address": "Nevada Shopping, Av. de las Palmeras, 75, 18100 Armilla, Granada",
                "lat": "37.14630761231548",
                "long": "-3.613396595477996"
            }
        ]
    },    
    {
        "id": "57",
        "icon":"./img/chipadvisor/57-kanival-burger.jpeg",
        "title": " Chip Review #57 - Kanival Burger, Malaga ",
        "content":  " <!-- wp:paragraph --> Greetings my fellow potato lovers, I join you once again in our collective endeavor to find the most bestest perfect chip. Once again, this didn't happen this week. It happened about three weeks ago now, maybe more. I don't remember. A quaint little restaurant in the center of Malaga that prides itself on using locally acquired foods. A noble effort, but how are the chips? Here they are... <!-- /wp:paragraph --> <!-- wp:image {\"id\":321,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2022/02/whatsapp-image-2022-02-08-at-17.13.36.jpeg?w=768\" alt=\"\" class=\"wp-image-321\" /></figure> <!-- /wp:image --> <!-- wp:paragraph --> Looks 3.5 - These chips do have an artisan flair, and I can admit that I was enticed by their looks at the start... until I noticed that they did not have salt on them. Or at least, not enough salt. <!-- /wp:paragraph --> <!-- wp:paragraph --> Taste 3.5 - They were even rather tasty, I think they were cooked with a nice flavoured oil, that had not been sitting there for more than two years. So once again, this is a nice bonus. <!-- /wp:paragraph --> <!-- wp:paragraph --> Texture 2.5 - Unfortunately, this is where the quality starts to slip. From the first bite I knew straight away that the chips were underfried. They could have been in the fryer for at least another ninety seconds. Very squidgy. Not good. <!-- /wp:paragraph --> <!-- wp:paragraph --> Condiments 3 - They came with a smoked mayonnaise, which to be honest was more than welcome. However, the lack of salt and/or salt availability was a damning negative. <!-- /wp:paragraph --> <!-- wp:paragraph --> Freshness 4 - Whilst they were definitely not fried for long enough, they were taken out of the fryer and brought to the table quickly enough.  <!-- /wp:paragraph --> <!-- wp:paragraph --> Overall 3.5 - They are OK enough, if you are in the area. Maybe they have refined the frying technique by now and you'll have a good time. Maybe they add enough salt and you'll have a great time. <!-- /wp:paragraph --> <!-- wp:paragraph --> Thankyou. <!-- /wp:paragraph --> ",
        "rating": "3.5",
        "location": [
            {   
                "name": "Kanival Burger",
                "address": "C. Alfredo Catalani, 2, 29003 Málaga",
                "lat": "36.702672159456434",
                "long": "-4.441656123745684"
            }
        ]
    },    
    {
        "id": "58",
        "icon":"./img/chipadvisor/58-titchfield-mill.png",
        "title": " Chip Review #58 - Titchfield Mill, Gosport ",
        "content":  " <!-- wp:paragraph --> Remember back at the beginning of the year when I said that I would be consistent with my chip reviews and not disappear for months on end? No..? Me neither... <!-- /wp:paragraph --> <!-- wp:paragraph --> In any case I am back (for now) with some chips I tried in the summer. Who doesn't like summer? The sun is out, the temperature is splendid, and there are always a vast quantity of chips to try. So here we are at the Titchfield mill in, well, Titchfield. It's a quaint little place that falls into the common trap of being ridiculously overpriced due to it looking nice. In any case, lets see the chips. <!-- /wp:paragraph --> <!-- wp:image {\"id\":335,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2022/09/image.png?w=1024\" alt=\"\" class=\"wp-image-335\" /></figure> <!-- /wp:image --> <!-- wp:paragraph --> Looks 4 - There is honestly something to be said about the great British pub chip. Long and thicc and always looking appetising. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Taste 3 - Once again (how many times have I said this now?) the chips lack taste and honestly could have so much more depth of flavour. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Texture 3 - Soft exterior with a soft inside. Half of the requirement I guess...  <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Condiments 2 - They did provide some sort of chili-alioli, but there was hardly enough for half of them, and it wasn't really THAT good. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Freshness 4 - As a slight redemption, they were at least able to bring the chips out in a rapid manner. Honestly, at this point I would prefer to have slightly colder chips that were cooked well. <!-- /wp:paragraph --> <!-- wp:paragraph --> Overall 3.5 - Not bad, not great. Would not recommend unless there was nowhere else open nearby. <!-- /wp:paragraph --> <!-- wp:paragraph --> Thankyou <!-- /wp:paragraph --> ",
        "rating": "3.5",
        "location": [
            {   
                "name": "Titchfield Mill",
                "address": "Mill Ln, Titchfield, Fareham PO15 5RF, United Kingdom",
                "lat": "50.85211319911196",
                "long": "-1.2314893335219683"
            }
        ]
    },    
    {
        "id": "59",
        "icon":"./img/chipadvisor/59-donner-haus.jpeg",
        "title": " Chip Review #59 - Donner Haus, Glasgow ",
        "content":  " <!-- wp:paragraph {\"align\":\"justify\",\"placeholder\":\"What are your two favorite things to wear?\"} --> <p class=\"has-text-align-justify\">I don't know why, but Wordpress has asked me what my two favourite things to wear are. I guess I would say that number one would be an XXXL shirt I got at a charity shop 10 years ago, which gives me endless room for growth, and my Christmas shirt. When it's Christmas. <!-- /wp:paragraph --> <!-- wp:paragraph {\"align\":\"justify\"} --> <p class=\"has-text-align-justify\">We're back to the summer now, with another holiday chip feast at the Donner Haus in Glasgow. My sister was raving about this place for weeks before we visited and I must admit that I had high expectations. Imagine our collective disappointment when we found that the menu had changed recently. Oh well, I ordered the biggest thing on the menu and got cracking with these: <!-- /wp:paragraph --> <!-- wp:image {\"id\":348,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2022/12/whatsapp-image-2022-07-23-at-20.34.28.jpeg?w=576\" alt=\"\" class=\"wp-image-348\" /></figure> <!-- /wp:image --> <!-- wp:paragraph --> Looks 4 - They do look good, a classic look of supplier-bought chips and fried moderately well. Can't complain about their appearance at all. <!-- /wp:paragraph --> <!-- wp:paragraph --> Texture 3 - Unfortunately I can still remember that distinct lack of crunch. The inside was fluffy and light but the outside had nothing of note. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Taste 4 - Oh they tasted good though, perhaps it was the sauce, perhaps it was the meat juice from the kebab meat (which was quite bland by the way) but these chips did pack a fair amount of taste power. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Condiments 3 - Garlic mayo and spicy ketchup were decent accompaniments to the chips but the fact that I had to pay extra for them will change this from a 4 to 3. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Freshness 4 - From my vantage point I could see the kitchen in full flow so I could literally see how long they took from fryer to table... which was about 90 seconds. <!-- /wp:paragraph --> <!-- wp:paragraph --> Overall 3.5 - A strong chip in the end which was let down by the meat that it was supporting. Would I eat these chips again? Probably not. <!-- /wp:paragraph --> <!-- wp:paragraph --> Thankyou <!-- /wp:paragraph --> ",
        "rating": "3.5",
        "location": [
            {   
                "name": "Donner Haus",
                "address": "85 W Nile St, Glasgow G1 2SH, United Kingdom",
                "lat": "55.8628501484812",
                "long": "-4.254880615991398"
            }
        ]
    },    
    {
        "id": "60",
        "icon":"./img/chipadvisor/60-nandos.jpg",
        "title": " Chip Review #60 - Nando's, Glasgow ",
        "content":  " <!-- wp:paragraph {\"placeholder\":\"What are your favorite physical activities or exercises?\"} --> I don't know what's going on with WordPress but it keeps asking me questions! This time, its my favourite exercises or physical activities. Well, well, well. I think we all know what my favourite physical activity is, don't we? It is, of course, table tennis. I also enjoy going to the gym sometimes when my body isn't made of glass, but that's beside the point. Let's talk chips! <!-- /wp:paragraph --> <!-- wp:paragraph --> Back to July and I'm back in Glasgow. Somehow I have spent nearly 300 pounds on food in the space of 10 days so I am trying to cut back on costs, and this is where Nando's comes in. Relatively cheap compared to other restaurants which is great as they give decently sized portions, too. Just like this very large portion of chips: <!-- /wp:paragraph --> <!-- wp:image {\"id\":357,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --> <figure class=\"wp-block-image size-large\"><img src=\"https://chipsreviewforu.files.wordpress.com/2022/12/319382730_931457974686237_767909241806951671_n.jpg?w=1024\" alt=\"\" class=\"wp-image-357\" /></figure> <!-- /wp:image --> <!-- wp:paragraph --> Looks 4 - Do they look good? Yes, they do. I feel that the Cajun seasoning is somewhat hiding the fact that they are actually anemically cooked, giving them more of a golden colour than they otherwise would possess. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Texture 2 - And, of course, this is where the lack of sufficient fry time comes bac to haunt the chip. Bland textures in my mouth, with not a single crunch to be found. To be fair, they weren't raw, so I guess that's where 2 points come to play. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Taste 3 - No flavour of potato to be found anywhere, but the seasoning once again is pulling all the weight. I would much rather eat these than a lot of other chips rated 3 in this section just for the salty spicy goodness. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Condiments 4 - I believe that Nando's believes that they can get away with poor chips just by having nice seasoning and sauces, and they very nearly can. So many things to choose from, included various spicy sauces, mayo and ketchup. Very nice. <!-- /wp:paragraph --> <!-- wp:paragraph --> <br>Freshness 3 - They didn't seem all that hot, which is strange, because I literally saw them fry the chips. Maybe it was the lack of time that didn't allow the heat to truly penetrate the chip, maybe not, who knows. Not great. <!-- /wp:paragraph --> <!-- wp:paragraph --> Overall 2.5 - Don't be tricked by this chip, the flavours hide what can only be described as a lazily made potato. <!-- /wp:paragraph --> <!-- wp:paragraph --> Thankyou. <!-- /wp:paragraph --> ",
        "rating": "2.5",
        "location": [
            {   
                "name": "Nando's",
                "address": "G1/R7, 55 St Enoch Sq, Glasgow G1 4BW, United Kingdom",
                "lat": 55.857312163734846,
                "long": -4.253010068232553
            }
        ]
    }
]